[
    {
        "review_id": "KU_O5udG6zpxOg-VcAEodg",
        "stars": 3.0,
        "text": "If you decide to eat here, just be aware it is going to take about 2 hours from beginning to end. We have tried it multiple times, because I want to like it! I have been to it's other locations in NJ and never had a bad experience. \n\nThe food is good, but it takes a very long time to come out. The waitstaff is very young, but usually pleasant. We have just had too many experiences where we spent way too long waiting. We usually opt for another diner or restaurant on the weekends, in order to be done quicker."
    },
    {
        "review_id": "VJxlBnJmCDIy8DFG0kjSow",
        "stars": 2.0,
        "text": "This is the second time we tried turning point at this location. The first time we had a long wait for food after ordering, this time we had an even longer wait of over 40 minutes. I had the omelette skillet and there was hardly any egg in it, I felt like I was eating chopped onions and chopped tomatoes. My wife had a BLT and had a hard time finding the tomato and the avocado that was supposed be on it. Overall,The experience was stressful, mainly because of the long wait."
    },
    {
        "review_id": "S6pQZQocMB1WHMjTRbt77A",
        "stars": 4.0,
        "text": "The place is cute and the staff was very friendly. Nice menu. Good for brunch. We had lunch and were seated right away. I really enjoyed the avocado  toast and side of bacon. Nice to have another brunch place nearby."
    },
    {
        "review_id": "WqgTKVqWVHDHjnjEsBvUgg",
        "stars": 3.0,
        "text": "We came on a Saturday morning after waiting a few months after opening hoping that they would resolve the issues from a new restaurant opening. We were seated right away and the server brought water, coffee and took our orders right away. We waited over 30 mins for breakfast. I got the freebird and came out first before my husband's dish. While it tastes good, it was just potatoes and the spicy sausage gravy was mostly a sauce. There was barely any sausage. My husband got the ny deli omelette that had way too much cheese that it overpowered everything and very little pastrami. Lastly, we were ready to go and our server spent at least 10 mins chatting at another table so I couldn't get our check. I'm not sure if we will return."
    },
    {
        "review_id": "M0wzFFb7pefOPcxeRVbLag",
        "stars": 2.0,
        "text": "Mediocre at best. The decor is very nice, and I like what the restaurant is trying to do, with healthy food options but the service is poor. My mother and I waited over an hour to get our entrees and our server never apologized for the wait or came to check to see if we needed anything. I ordered the big easy benedict, which was supposed to have chorizo sausage and I literally had maybe 5 small slices of chorizo and the rest of my dish were the eggs and vegetables. Definitely not worth the money. I will give one star for the decor and one star for the manager who did stop by our table to take our drink and food orders when our waitress disappeared and did try to keep an eye on us from time to time. Their servers definitely need some training as well. Two of the people who brought food to our table did not know what dishes they were serving us and said the wrong names when they served our food/drinks. I don't see any reason to go back here."
    },
    {
        "review_id": "fj7N9Lp6AvEEy6LHrDZzjw",
        "stars": 2.0,
        "text": "When I was shown to my seat of was still wet so I had to use the napkin to finish the job. Place was full and service was poor. I ordered the Atlantic Tuna melt - not convinced that the tuna was fresh and it was cold. I ate half only - no one asked why - not the place if you are in a hurry"
    },
    {
        "review_id": "uyS0ysaMd4mzw5rNYbgcjA",
        "stars": 3.0,
        "text": "Food is fantastic, service is quite awful!  Call ahead if you can so you don't have to wait.  It took us 10 minutes to have our server acknowledge us once we waited 35 minutes for a table.  It took another 10-15 to get coffee, and were never given cream. We were given a pitcher of water, but had to ask for glasses so we could drink it.  They are understaffed and we visited on a Saturday morning when they were having a special event, so they should have known better! Food was amazing and my fiancé loved his coffee!  We definitely got better service at the Warrington location, so if you're thinking about trying this place out I would say go to the Warrington one.  They also have a better waiting area and full counter service area to get coffee while you are waiting!"
    },
    {
        "review_id": "N44SRxMD6GXUPgkLUuu6Zw",
        "stars": 5.0,
        "text": "I went on a Thursday morning for breakfast. Staff was attentive and the omelette was excellent."
    },
    {
        "review_id": "R10wk4xEHX9r-qs5Z_2vvw",
        "stars": 3.0,
        "text": "Update: I deducted a star because they no longer offer their white peach pear iced tea! We moved to London for work so I guess I missed the memo. Unaware, we went for breakfast when we were in town a few weeks ago. As soon as we were seated I ordered my (what I thought was going to be first of many) White Peach Pear Iced Tea. Big smile on my face - London has great hot tea but crap iced tea...you really have to make it yourself usually over here. At any rate - denied. \nWaitress: \"Uh we don't have that any more.\" \nMe: (checking the menu in disbelief, mouth agape in horror) \"What?!?\" \nHer: \"Yeah, like, I don't know why they did it...it was really popular.\" \nMe: (suspicious it might actually be my own fault given how many refills I always ordered and how often we frequented Turning Point): \"Yeah, doesn't make sense\" \nMy husband: (impatient and not trying to be helpful despite whatever he says) \"Just order something else\"\nMe: (withering glare putting him on notice...thinking that iced tea is the ONLY reason I come to Turning Point so often) \"You order first\"\n\nAfter trial and error I found you CAN order the (available as hot only) White Orchard tea with two accompanying glasses of ice and make your own. But, hell, I might as well be eating breakfast in London slopping the whole table up with tea drippings and condensation. Plus I miss the pure joy of having a perfect White Peach Pear Iced Tea in a takeaway cup to savor while my husband is dawdling his way across Home Depot or something. So yeah, Turning Point - one less star. Take THAT!"
    },
    {
        "review_id": "BkdgkKU1uvUW0-LhfS2JVw",
        "stars": 1.0,
        "text": "The food better be good because the iced coffee is horrible, and the service is deplorable.\nParty of 3, sat at the counter when it wasn't overly busy. Waited about 10 minutes for beverages, and then another 15 just to order.\nNow we have been waiting for over 30 minutes for our food.\nMeanwhile, friends of a server popped in, had drinks in immediately, and magically, their food.\nDo yourself a favor and go anywhere else."
    },
    {
        "review_id": "wfJS0o2_absa6lYYuVnz4g",
        "stars": 4.0,
        "text": "This place is conveniently located at English Village right next to the J Crew store. The decor is well done. It is low key and welcoming.\n\nFirst thing you see when you walk in is the espresso bar. They have French press options on the menu as well as espresso and the unlimited house coffee options to fill the range of tastes and budgets.\n\nI ordered the huevos rancheros, which came in top of a plate sized tortilla which might have been able to hold itself together as a huge breakfast burrito. If you don't know what huevos rancheros is, think of it as a typical American breakfast of eggs, home fries and sausages (this case chorizo) topped with salsa. In this case they also had a half of an avocado and sour cream. Tasty.\n\nWife has acai berry crepes which were a special. And we ordered two pancakes for the kid. The pancakes weren't special at all, but they weren't bad.\n\nConsidering that it was Mother's Day, the service was great. They even had a large mug as a giveaway to all the mothers. Sadly the one we brought home had a crack when we took off the cellophane. Thankfully we don't need another mug."
    },
    {
        "review_id": "241ycTAVakh4sY8b7S_jyQ",
        "stars": 1.0,
        "text": "\"Who's in the kitchen and why can't they do their job?\"\nReviewed 2 days ago NEW\nI had high hopes for this eatery but I got over that with just one visit. Arrived a little after 12p.m. on a perfectly lovely day with four other adult family members. The restaurant makes a nice impression with it's white beadboard trim and large windows. I'm thinking this is going to be nice. We were seated fairly quickly once they had converted a square table to round to accommodate our party of five. The waitress was friendly and attentive at first. Took our orders, poured our beverages etc. Tick, tock, it took 45 minutes before our food was served! If 5 is a big party, they are in big trouble. But the fun doesn't stop there. Out of 5 entrees there were 3 errors. Mom asked for sausage, she got bacon, Sister asked for multi grain bread, she got sour dough, hubby ordered a Tuscany omelet and got a Western. My tuna melt was accurate but miserably cold. Okay let's go with 4 out 5. My brother-in-law was happy with his Cuban. We're still trying to figure out how that happened. My advice, skip it!!!"
    },
    {
        "review_id": "nU0rOSN0x-PKGXzappMUmg",
        "stars": 2.0,
        "text": "Hopefully they will find their way but this promising new breakfast/lunch joint is a disaster. After waiting we'll over an hour for a table our waitress forgot our drinks and the food that came out was not what we ordered. The avocado toast was tasteless and not up to speed while the rest of the food was on par with a greasy spoon joint and not the modern fresh atmosphere suggested. I suggest we all give them time to find their legs, train their staff, and improve the quality of the potentially appealing menu."
    },
    {
        "review_id": "YX2cFHDxlUfGnQ8bHPq4cA",
        "stars": 1.0,
        "text": "Not Impressed at all. Ordered a omelette and bacon.\nThe bacon was forgotten and never arrived.\nAlso received a English muffin. No butter or anything. Just a dry sliced muffin. Fresh squeezed orange juice was very disappointing.\nFood was dropped off and did not see server again.\nWon't be going back again until picking up the plates.\nHUGE DISAPPOINTMENT"
    },
    {
        "review_id": "pDN3hRBarmGWXbK64A83MA",
        "stars": 1.0,
        "text": "never coming back here again. all of the glasses had a crusty cloudy look to it. silver ware and coffee cups were all crusty and dirty. waiter spilled coffee all over our table and didnt bother cleaning it up. i ordered the green juice and on the rim of the glass cup it was covered with what looked like rolls of dust and particles. as i ask them to replace it, but instead they just wiped it with a napkin and gave it back to me with particles still covered around it. it looked like they stored the glasses in a very dusty dirty shelf or kept them on a dirty floor. i didnt bother drinking it nor will i come back to this filthy place again. there are flies everywhere in the resturant also."
    },
    {
        "review_id": "yT87_j7RyUTdHMuG0hvHXA",
        "stars": 5.0,
        "text": "Went here over the weekend,  got my sugar rush on with the salted caramel waffles.  Awesome!!!  Staff was happy and helpful, noticed that kids got a little cup of fruitloops if they were waiting for a table. That's a nice touch for families.  The coffee was fantastic, parking was tough as the plaza is very congested.  Good place!"
    },
    {
        "review_id": "xk5FILQ4R_krWSYKJybUWA",
        "stars": 5.0,
        "text": "This place is delicious. I like how to food is a twist on the classics. I love the vanilla chai tea latte they have, it's different and love the cute attention to detail with the sugar spoon. The lemon blueberry pancakes were good as well. \n\nThe manager is very hands on and really seems to really know the business. I really needed my check and my waiter was tending to another table, the manager noticed and got me my check and packed my leftovers asap."
    },
    {
        "review_id": "ae5On6KCPiglMQJ--1JcTQ",
        "stars": 2.0,
        "text": "I don't recommend this place for breakfast. The only reason I would go is if I didn't have other options or got tired of visiting the same places over again. The food was not really good. I had the avocado toast, which was very bland, and the Popeye Skillet, which was mediocre and unappetizing."
    },
    {
        "review_id": "i5jMeyoJSbUrQ7T-AU22_A",
        "stars": 1.0,
        "text": "Well, lots to say. Managers were busy makin coffee drinks and totally ignoring the business. Tables were ready and set but empty. The \"15 minute wait\" became 30. People that work there appear to be miserable and in slllloooowwww motion. Waiter brought table next to us their food holding a dirty rag and said \"this is a really hot plate. The heat is coming through this rag.\"  Ummm. After seeing and hearing that we were kinda disgusted. Our meal was fair. My skillet was hot but the food was not. Sad- the menu is great but will not return unless a major re-do happens."
    },
    {
        "review_id": "ScBqrVWtpnOmHZwZ7zHfVg",
        "stars": 2.0,
        "text": "So we live turning point. Warrington is great tho the wait is long. The new one in north wales is pure and simple- filthy. Floors full of food and crayons. Tables leave you walking out sticky like honey. Chairs all so dirty I'm afraid my pants will have stains on it when I stand up!  \n\nStaff is great. Manager great. Get the cleanliness right and I'll be back for more!!!"
    },
    {
        "review_id": "ptpHomDWWvwu_mMEYKu5Ig",
        "stars": 3.0,
        "text": "Okay here's a great example of too much management, no not enough. Well, something is wrong here and it isn't the food. I counted 14 waitstaff, four hostess, one guy in black that did nothing, and a manager that liked to talk into his earpiece rather than help.\nThis is a concept restaurant. It has worked before. It isn't working here. So when a waitress tells you \"all our food is made from scratch\" before anythjng else we know the translation is \"our kitchen is very slow, and we won't bd getting your food to you in under an hour.\" Yup. An hour. Not from scratch. Bagels from scratch, no. English muffin, no. Bread, no. Own sausage, no. Smoke the bacon, no. Organic eggs, no. Butter, no. So what did you make from scratch? \nWe ordered french press coffee. It was past brew when it hit the table 15 minutes later. No cream. Ask waitress for cream. Ask manager for cream, he snarked something back, which is what earned this review. Waitress brought cream five minutes later. He couldn't be bothered. Real important stuff going on in that earpiece! \nFood was okay, not great. Coffee was brewed too long. Breads were burned with no butter. Eggs cooked close to order. Sausage and bacon were precooked then put back on (a pet peave of mine). \nWould I ever go back? Maybe. \nOooh, they also have a calculated tip percentage on the bottom for referrence. 25%!!! Yeah, um, no."
    },
    {
        "review_id": "5NQW0xLtyTJKWWjwk9XmMA",
        "stars": 3.0,
        "text": "Turning Point is a chain that has recently opened a number of restaurants around our place in Horsham, PA. We enjoy the North Wales location the most, though Warrington is a close second. Blue Bell only opened recently and has yet to get its act together. Food is good but my favorite is the iced tea. I get the white pear ices tea and they just keep bringing refills - even one to go if I ask!\n\nI'm not going to deduct points from North Wales or Warrington because if you call ahead they get you right into a table but I do want to warn you not to trust calling ahead for the Blue Bell location - egads! One time we called two hours ahead for a table for four people and had to wait close to an hour. Second time we called three hours ahead for a table for six, waited almost two hours. The math for Blue Bell's not working out for me...YMMV. My recommendation: eliminate call ahead for this location or make it work like it does at the other locations."
    },
    {
        "review_id": "_OnOar1g-aNi-TldEJBplA",
        "stars": 5.0,
        "text": "I was very impressed with Turning Point! My roommate had raved about it for so long, I was glad the North Wales location had finally opened so I could try it for myself. \n\nI definitely wasn't disappointed by the popular brunch restaurant, everything was perfect and I left stuffed! We sat outside since it was a nice day and the service was great, our waitress was very attentive and checked in on us repeatedly. \n\nI started out by ordering the iced coffee that also came with one massive coffee ice cube, which ended up being fantastic since it wasn't watered down at all. This was a tough decision to make since the coffee menu was impeccable and almost an entire page itself, but it was a great decision! \n\nFor breakfast there are a variety of options, this includes some of the many healthy ones. I opted for the popeye skillet which was everything one could really ask for in breakfast. Potatoes, spinach, mushrooms, eggs of your choice (I went with poached), sour cream and lots of yummy cheese. I would highly recommend giving this place a try!"
    },
    {
        "review_id": "jHmqmoEI-78BGHFJaDKlhQ",
        "stars": 2.0,
        "text": "Excellent food but slow, slow, slow. Staff needs training. I don't know if it is worth it to return. Kudos to the chef"
    },
    {
        "review_id": "MAKXWgiy0MEMO6vEuX5SyA",
        "stars": 4.0,
        "text": "Finally had a chance to try Turning Point for lunch with a good friend.  We split the OMG French Toast, and Shrimp on the Benny, tropical ice tea, and French pressed coffee.  Everything was delicious, I left stuffed and can't wait to go back.  Our waiter was attentive, and friendly."
    },
    {
        "review_id": "iDlzJkjc05zCWRXXM6ELiA",
        "stars": 5.0,
        "text": "My family loves to meet at Turning Point in Montgomeryville, PA for brunch.  The restaurant is very bright and inviting.  The manager and the whole staff make you feel very welcome.  The food is so fresh and delicious, and tends to be on the healthy side.  I would highly recommend this restaurant to anyone."
    },
    {
        "review_id": "Upm2iAmHKgPjs8s_5YDPvA",
        "stars": 2.0,
        "text": "Food was good however service was poor.  Ordered drinks and received them well after a couple seated after us received theirs.  In fact i had an empty bottle of ketchup and asked a waitress for a new one.  She answered yes, walked back and forth multiple times and never gave us a new one.  Im going to give it some time before considering going back."
    },
    {
        "review_id": "HxWtq5q4OQ-4osStqn54bA",
        "stars": 2.0,
        "text": "Unfortunately the weekend chef doesn't know how to properly poach eggs for their \"classic Benedict \". I'm not a very fussy eater and had to send the first dish back because the egg yokes were hard. The second dish was absent of yokes. Potatoes undercooked too. Over priced for what you get. Stick to your local diner as you'll leave satisfied."
    },
    {
        "review_id": "0hsP_4rqBkNjcKQHQG_ZiA",
        "stars": 1.0,
        "text": "Nice staff. Painfully slow food service 1st time, 2nd time, and there won't be a 3rd."
    },
    {
        "review_id": "Rjxkkwuvys5bPw19UaFgiQ",
        "stars": 2.0,
        "text": "When I was shown to my seat of was still wet so I had to use the napkin to finish the job. Place was full and service was poor. I ordered the Atlantic Tuna melt - not convinced that the tuna was fresh and it was cold. I ate half only - no one asked why - not the place if you are in a hurry \n\nTried them again on Jan 13th - had an Eggs Benedict - one of the eggs was under done which I hate - taste was good but again make sure you have plenty of time for lunch - no quick lunches here"
    },
    {
        "review_id": "UNQ9TK31_Hf9BOTyp4GaDw",
        "stars": 2.0,
        "text": "This location isn't run as well as other Turning Points I've been too quite yet.  Hope it improves because it is a great    location.  Team is nice when you can get their attention but seem to need better coordination and training."
    },
    {
        "review_id": "4VZ-zoW03Rsh6vA5qe7YQg",
        "stars": 2.0,
        "text": "nice location and great decor but the food was very average and the servers did not have it under control. was sat and given our drinks in about 5 mins but then waited another 50-55 mins before our food came out. Would not recommend coming here."
    },
    {
        "review_id": "tUElF5FKUfyWLe4ELZ04kA",
        "stars": 2.0,
        "text": "Decided to try brunch with the family today, they don't take reservations, however will take your name and how many and a time.  So we arrive, don't have my name, and waited 45 minutes for a table of six.  Breakfast, French toast, eggs benedict, just fair.  The sides don't have prices marked, so 3 small pieces of bacon cost $3.50.  Waiter seemed like a nice guy, trying too hard, checked in way too much, tried to get us to buy appetizers, got us to bite on the authentic maple syrup vs. imitation syrup, and cornbread, of course, no mention of extra charges.  Food quality and service could be improved."
    },
    {
        "review_id": "B5SvhkXo8WFixmXNH9Y70Q",
        "stars": 2.0,
        "text": "Went for breakfast this morning....iced coffee was good and free refills but the menu specifically said \"iced coffee icecubes\" so as not to water down, but they were regular cubes...had eggs over easy on the huevos rancheros, they were under-cooked...friend had chicken n waffles and 1 of 2 waffles was severly under-cooked...wife had the wilbur skillet and she got undercooked eggs as well and the avocado was nonexisitant....2 stars are for fast, friendly service and the drinks....also, wife had to request a new knife because the original was filthy"
    },
    {
        "review_id": "cTg9LYxSrZscI2tU9RNGZw",
        "stars": 5.0,
        "text": "This place is delicious. I like how to food is a twist on the classics. I love the vanilla chai tea latte they have, it's different and love the cute attention to detail with the sugar spoon. The lemon blueberry pancakes were good as well. \n\nThe manager is very hands on and really seems to really know the business. I really needed my check and my waiter was tending to another table, the manager noticed and got me my check and packed my leftovers asap. \n\nUpdate:\n\nI came here again and it was an overall another wonderful experience. \n\n I got the vanilla chai tea latte again, they didn't have the sugar spoon, wasn't sure if this was a mistake or they are no longer doing it, but it was delicious as always. The salted caramel waffles were amazing, I asked for no bacon.  In the southern eggs Benedict the cornbread is the best part. I will admit I prefer sweets over savory which is why i found it just okay when it was pretty much perfection it it's appearance and taste from the description given. and a chocolate milkshake.  \n\nMy server was kind and attentive. Most importantly I didn't feel rushed despite being seated 20 minutes before closing and staying 20 minutes after."
    },
    {
        "review_id": "fvu5n5shkAJDbQjulKNuqw",
        "stars": 2.0,
        "text": "I really wanted to love this restaurant.  The interior is really well decorated and the food looked awesome.  My wife and I stopped in for breakfast on a Sunday in May.  There was a 15 minute wait but there were (2) seats at the counter so we grabbed them.\n\nOur waitress came right over and introduced herself along with the other girl working the counter area.  We perused the menu and placed our orders.  My french press coffee came out quickly but that was the only thing that was quick.  After 30+ minutes our meals came out and during that time neither of the girls behind the counter checked on our drinks or gave us an update on our food.  After speaking with several other people it seems the long wait times are the norm.  Hopefully they will work the kinks out since they are fairly new.\n\nI had the Big Easy Benedict - Cornbread topped with avocado, creole seasoned onions, peppers and chorizo. Topped with poached eggs and cajun hollandaise.  The corn bread was awesome and I would give the entire meal a solid B.\n\nMy wife had the Fruity Chicken Salad - Two scoops of homemade chicken salad accompanied by California raisins, fresh seasonal fruit on a layer of baby spinach leaves with an english muffin.  The Chieck Salad was good but she thought the portion was small.\n\nIf I was just reviewing the food I would give it 3 1/2 stars but the wait and service was so poor I had to bring the overall rating to 2.  I will return and see if the service improves."
    },
    {
        "review_id": "0O94-lsE4GLu6OKxNJMqng",
        "stars": 5.0,
        "text": "Love the Kona French press here! Takes me back to Hawaii! Had the Big Easy Benedict and it was delicious! My wife had the Wilbur skillet and another great dish. The server couldn't have been more attentive and friendly. Cant wait to get back!"
    },
    {
        "review_id": "DjNpXU9rLjt5Lj6509zwRg",
        "stars": 1.0,
        "text": "While the food is good, the service is terrible and the staff is rude. I recommend choosing somewhere else"
    },
    {
        "review_id": "avH6BWW3ZiUzsBwP1c8JbQ",
        "stars": 1.0,
        "text": "Went to the turning point with our friends today for the first time and it will be our last. We were seated promotly and waited over 50 minutes for breakfast items we ordered. 50 minutes for breakfast and being told the kitchen is really backed up. I could have had our 4 items we ordered done in 10 minutes especially in a commercial kitchen and I am far from a chef. I ordered the basic skillet. Potatoes were over salted and this dish comes with eggs that were over cooked after asking for over easy created an extremely dry dish. Manager comped our meal but was not very friendly. Felt very sorry for our waiter. He was stuck in the middle.  Other breakfast items were only okay and really nothing to rave about. If this place survives I will be amazed unless they change their kitchen crew. Breakfast really is not that difficult or that hard to make. If you fail miserably at making breakfast you probably will not do well at asking anything more difficult."
    },
    {
        "review_id": "VcYCE4VAeFcximi0-WuK7A",
        "stars": 1.0,
        "text": "Today I went in expecting a nice family brunch. After waiting we were finally seated and ordered our meal, only to end up sitting for over 50 mins with no food. I went up to talk to the manager, to try and explain how the other table seated much later were able to get their food before us. My husband left church early just to spend time together and had to return back, so we were trying to accommodate. But instead of apologizing and showing signs of concern, the manager's first comment was \"I can pack in to-go box\". We sat for 1 full hour! Really?\n\nSo when the food came out, we returned the Reuben sandwich, since my husband was now gone, and upset. \n\nWhen we asked for the bill, I got a check for all three orders which was taken care by \"Manger Comp\". \n\nI understand mistakes can happen. But the way the manager dealt with our situation, was very unkind. He should have been more polite and accommodated us more professionally. It was my first time, and I will probably not go back to this place again, unless they have a more established system working around it. \n\nWe went in there with happy mood, sat there waiting for our food for an hour miserably, only to decide to simply eat and go. The \"comp\" check that was brought to us by the server, and not by the manager himself made it that much more upsetting.  This made myself and my daughter feel upset and we left with a sour feeling about the whole place. \n\nI plan to take this up to the corporate manager about how we were served by the server and about how things were handled by the manager!  Terrible first time experience here!!!"
    },
    {
        "review_id": "iEh6HVabisUoJASFEvSYEg",
        "stars": 1.0,
        "text": "Horrible experience. First, it was crowded on Father's Day, which we expected. Once we were seated, I notice that the table was wobbling and it spins.  I informed the waitress about the table.  She couldn't do anything about it.  When we got our coffee, I realized that she forgot to give us spoons for the coffee. Finally, our food came. Again, I realized that she forgot to give us our utensils to eat the food.  I had to walk to the front and inform the hostesses that we had no utensils.  Everyone got their food except me.  The chicken with waffles took forever the make.  I will never go here again."
    },
    {
        "review_id": "e0wev6krqh76B80GGQ7nMg",
        "stars": 1.0,
        "text": "Terrible service. Waiting staff is very disorganized, cannot take down the clients name correctly. It's a luxury to get greetings out of them, food is mediocre at best.\nLast time we were here waiter delivered wrong order to our table, spilled fruits all over when setting down the plate. Then he quickly picked up the plate and delivered to the right table, I doubt that guest had any clue."
    },
    {
        "review_id": "AuTScCoitEKwIaAEp_R3ew",
        "stars": 1.0,
        "text": "I was exited to meet with my bosom friends for brunch at this new joint. Maybe we were more focusing on each other than actual foods. The atmosphere was lively. The food came out rather too  fast and then the waiters and waitress started  coming every 5 minutes to ask if we finished eating or needed anything else etc. We felt like our conversation were constantly interrupted and wound up not finishing foods and left the place to talk at elsewhere. Waisted $50 for waffles, egg Benedict and brunch size salad and coffee in less than an hour. We will never go back."
    },
    {
        "review_id": "OTODlR88KHVb5wNyRdulGw",
        "stars": 2.0,
        "text": "Took some colleagues here for lunch based on a recommendation. We chose mostly breakfasts. The meals were lackluster. The service was terrible. Although the waitress was friendly our meals arrived in two parts. My friends meal arrived minutes later and we watched them take it outside to a table and then back into the restaurant and delivered to him. Our meal portions were small and overcooked. Waited forever for the check. The worst part was the acoustics as it was incredibly loud in the room. I might give this another chance but will wait for them to get their act together if they can."
    },
    {
        "review_id": "KAXtFKuSw_yPgHhKO_Je3A",
        "stars": 4.0,
        "text": "This was kind of brunch place i have been looking for. This was 2nd time going back , food was pretty good! Will def go back"
    },
    {
        "review_id": "WMKe201GP7G3iL_xlHxxHg",
        "stars": 2.0,
        "text": "A whole lotta nothing. Great space, Phenomenal menu. Problem was the food didn't have any flavor. I had an omelette where the Asparagus was undercooked and it had no taste. The grain pancakes were good, not special. My wife had a frittata that was Disguised as an omelette. Once again lacking flavor.  The servers screwed up our order and didn't really take ownership.  I'll give them credit in that they were flexible in modifying dishes.  Would not go back"
    },
    {
        "review_id": "KdcENhUtYYo6bg_bf940Tg",
        "stars": 1.0,
        "text": "Had been impressed with this place when it first opened. Good food selection, different then other places. But had to walk out this morning because the counter was not cleaned for a good 15 minutes while we sat. We watched others leave as well. Didn't appear to be that crawded so not sure why the poor service. Hopefully they can clean up their act."
    },
    {
        "review_id": "h78e76_7JSSBvZ7L7oasqQ",
        "stars": 4.0,
        "text": "The service was a little slow but the food was good. I had the protein bowl and it was a good size for the price. The cold brew coffee was decent, nothing special aside from the presentation. The bathroom was clean. I would eat here again."
    },
    {
        "review_id": "WglA0BSYvc3WBP4I2WpRwA",
        "stars": 5.0,
        "text": "I've been here now twice for brunch and the food is amazing. I've seen other yelpers mention that the service is terrible, but I didn't experience that today. I ordered the chicken and waffles dish and so did my aunt that I was with. She cannot eat pork and we didn't realize there were bacon bits on top of the dish. Our server immediately got the manager and a new dish was made right away. I can't wait to come back for the french press coffee and more chicken and waffles!"
    },
    {
        "review_id": "3KIFs2G29KtGhgMQnI5iPw",
        "stars": 1.0,
        "text": "Took forever just to get our coffee. We received one of our breakfasts fairly quickly but my fiancé never got his breakfast so we had to split my omelet. Not worth the money or the service."
    },
    {
        "review_id": "vxc7iYXt3Tf-zr8Ro0GQzQ",
        "stars": 5.0,
        "text": "Not sure why the rating is so low. Been coming here since they've opened and they are always packed. Great French press coffee and the staff is really working hard."
    },
    {
        "review_id": "TUdn57Z_Nb9VDhNHNq9q4g",
        "stars": 4.0,
        "text": "Went here with my best friend for brunch, great little place. They had adorable fall decorations and we were seated quickly. Upon bring seated we were instantly brought a pitcher of water for the table before they took our drink orders, which I thought was a nice touch. We ordered their pumpkin spice lattes which were very tasty. For our entrees we shared these delicious chocolate chip pancakes that were supposed to come topped with strawberries and berry syrup (but we asked for that on the side) and then my friend ordered a bubbie sandwich (pastrami) and I ordered a turkey reuban. The food was delicious, but I must say that I was slightly disappointed that 1 of the slices of bread on my sandwich was half burnt...otherwise the food was fantastic for a restaurant that focuses on breakfast and lunch. The only other complaint I have is that our waitress wasn't very helpful when asked questions about the menu. All in all, Turning Point is definitely a place I'll be returning to in the future."
    },
    {
        "review_id": "gAmk6yKYw1_Xx2Pf7Q6DUw",
        "stars": 1.0,
        "text": "Having heard about this brunch place from place, we stopped by today for brunch and sadly, didn't go too well. We're vegetarian and ordered a vegetarian dish (zucchini spaghetti) and found a piece of ham in it three quarters of the way through the meal. So although the rest of it tasted pretty good, I would rather have a had a bad tasting meal that didn't have contamination issues. This is pretty unacceptable.\n\nThe manager and the waitress were very apologetic and it was obviously not their personal fault. However, it would be if this repeats. Mistakes happen but the biggest mistake would be if this restaurant didn't make a big deal of this error and fix it in a way it never ever repeats for another customer. I strongly suggest that they educate their staff on vegetarianism and food contamination issues. My hope of raising it again here is that it is escalated to the right individuals and receives the attention it deserves."
    },
    {
        "review_id": "r_U0WuP8D9YLaZYKiyGioQ",
        "stars": 1.0,
        "text": "The chicken and waffles would of been delicious had it not been served cold. Waited almost an hour and a half for food after being seated. The food has a chance but the service is terrible."
    },
    {
        "review_id": "RaJNJ7zOvU3y9HGH2kVCWg",
        "stars": 1.0,
        "text": "We just tried to go here for lunch. Arrived around 12 pm and were seated by 12:15 which was great. The waitress took our order at 12:30 and then came back at 1:15 saying there was a back up in the kitchen so we shouldn't expect our food anytime soon. We had already been waiting for 45 minutes so we left. I have eaten here before and the food isn't good enough to justify 1+ hour wait time for food to come out. I won't be returning to this location as this has happened to us before. The wait times are ridiculous."
    },
    {
        "review_id": "XP0uRMr4lRz5-IFbpT7-wg",
        "stars": 1.0,
        "text": "I have eaten here in the past without any issues and decided to bring my boyfriend here on New Years Day. Horrible experience- we waited 45 minutes to get our food. I asked for a manager who brought our food out several minutes later and stated the reason we did not receive our food was because the order wasn't put in til 13 minutes ago. Which means the waitress that took our order neglected to put it in. How do you forget to put in an order??? Grant it we ended up getting the food for free but the avacado toast looked rushed and had too much oil on it and the tuna melt had way too much tuna. I may give this place another chance only because  past experience wasn't so bad but they definitely lost my boyfriend as a customer."
    },
    {
        "review_id": "vwIXZHod-jQmGFvx0wCqSg",
        "stars": 5.0,
        "text": "After reading a ton of mixed reviews, my fiancé & I decided to try out The Turning Point for breakfast. We went pretty early on a Saturday morning. I assume it was before the breakfast rush because there was no wait and our food came out with in 10-15 minutes of placing our order. I'd love to go back & try out their awesome drinks & lunch menu."
    },
    {
        "review_id": "13hBzvtBEDw-lj5STbhsXg",
        "stars": 2.0,
        "text": "It takes a lot for me to give a bad review, but this place really needs to get its act together.  They've been open for nearly a year and still can't manage to serve food in a reasonable amount of time.  Literally, every single time we've been there, we've been brought some \"complimentary\" appetizer as an apology for the wait.  Nice gesture, but I'd rather just have my food in a timely manner.\nToday was the worst experience yet.  I ordered the Popeye Skillet (my favorite) with scrambled egg whites.  About 40 minutes after ordering, our table of 6 was served our meals over the course of about 10 minutes and my meal came with regular scrambled eggs.  They took it back and it came out again 10 minutes later -- clearly with the regular eggs scraped off (several bits still remaining), and an unappetizing-looking pile of way undercooked egg whites (which I ended up scraping off and not eating anyway).\nWe were given some free entree cards to come back, but I just don't know if I have it in me to keep going back.  The food is really excellent most of the time, and they have a great menu, but the wait and inaccuracy is ridiculous.  The servers are very nice and they try hard, but the kitchen is absolutely killing them."
    },
    {
        "review_id": "0nhoa1RFz3uSsrLpFHKo5g",
        "stars": 2.0,
        "text": "Unfortunately I did not have the best experience here. It took about 2-3 hours to get our breakfast and it was all over cooked. For such an expensive breakfast place, I was disappointed in the service and the food."
    },
    {
        "review_id": "3yp1kwalgmgtgmmy5PYrpw",
        "stars": 5.0,
        "text": "Fantastic meal!  We didn't have to wait long and the service was spot on. Manager was quite friendly and it seems like the place is well run!  I am not adventurous in my food choices, so I ordered a cheese omelet,. It was quite delicious!  We will return soon"
    },
    {
        "review_id": "jjTKYqtog8ig5zkQ770v8Q",
        "stars": 4.0,
        "text": "The food was great and the prices were fair. Our waitress was extremely nice and helpful. We didn't have to wait at all for Sunday brunch and sat at a nice table outside. The fruit bruschetta was unique and tasty. According to my boyfriend, the hollandaise sauce for the eggs Benedict was a bit mustardy, but my blueberry-lemon pancakes were cooked to perfection. Overall great experience."
    },
    {
        "review_id": "mPaBlIjwKF41oda5cXqbyw",
        "stars": 2.0,
        "text": "Let me start by saying that the food and coffee were delicious.....when it finally arrived.  That might be the only positive thing about my visit.\nWhen I ordered my coffee I asked if the French press came in different sizes.  My waitress told me that I would be charged based on number of people drinking from the carafe, not on the size.  It would cost me about 4 dollars. This did not make sense to me, but I ordered it.\n\nI waited for about 45 minutes for our food.  I ordered the OMG French toast and it was delicious.  In fact, all of the food coming out of the kitchen looked tasty.\n\nWhen we finally received our check I was surprised to see two charges for the coffee.  One charge ($4.50) for the coffee and one charge ($4.00) for the flavor.  This did not sit right with me and I asked the waitress about it.  She brought over their manager who needs a serious lesson in appropriate manners.  He brought the menu over and tried to show me the prices.  I explained that I understood those prices but that they weren't what I was told.  The manager proceeded to scold me in front of other customers, telling me that I need to read the prices on the menu.  He took the coffee off my check but that wasn't what I was even challenging.\n\nThis place needs some serious help with their customer relations.  It is extremely disorganized, with waitstaff running around, management scolding wait staff in front of customers, and staff arguing with one another in front of customers."
    },
    {
        "review_id": "PoawAhYNMYaCgfqSXOi7JA",
        "stars": 4.0,
        "text": "Absolutely love this spot for breakfast & brunch! They do a great job adjusting for restricted diets and have many low-carb or keto options if you're watching your carb intake. They even have almond milk, soy milk, and heavy cream as alternatives to half & half for your coffee. There's both indoor and outdoor seating, and ample parking. I will definitely be returning soon!\n\n***Update***\nI've been to this Turning Point location several times now, and unfortunately each subsequent visit has not lived up to my first dining experience. The wait time seems to be longer each time I dine here, dishes frequently come out wrong (e.g. item has cheese when requested to remove, salad has dressing on it rather than on the side as requested), and their iced drinks - coffee and tea - taste stale and old. I've removed only one star because it really seems like they're just trying to find their footing since they've recently opened and are no doubt training new wait staff. I really hope they can work out these kinks because this place has so much potential!"
    },
    {
        "review_id": "Qtcmrw061WKm8yua_FLXrA",
        "stars": 3.0,
        "text": "I have been here something like 10 times, and it is extremely hit or miss. The service is extremely slow. Expect 75-90 minutes per trip. Last time I went with my wife, we had to go through 5 sets of silverware before we were able to get a clean knife and fork. Coffee cups were dirty. Food took over an hour to get to our table. \n\nFood is inconsistent as well. Sometimes they cook the veggies down before putting them in your omelette, most times they don't. \n\nCoffee is great here and I enjoy the menu, but management needs to step it up."
    },
    {
        "review_id": "VSdW8LlGymL9_6y9e_exYA",
        "stars": 2.0,
        "text": "Sorry to say this is a once and done for us.  Some good things but not worth it overall.  Pumpernick's up the road may not have the atmosphere as here but they do it so much better (and less expensive). \nSo here is my review in more detail...\nGlad to get breakfast at 11:45 weekday where this usually busy restaurant was half full. Coffee was very good...hot and a pot for the table was an added plus. Love that. Waiter was engaging and sweet but extremely forgetful and slow.  Forgot the extra napkins, forgot the water, forgot the water glass and was sloooow to bring the check and even slow to take our order...had to flag him down.  $27 (without tip) seemed rather high for two omelets and 2 coffees.  Especially since the hash brown potatoes  were mostly raw and had horrible tasting seasonings (Should have sent them back).  The English muffin was barely toasted and tasted very doughy.  We asked for jelly...oh that too was initially forgotten, and two small packs were dropped off.  Not quite enough for the two of us but we made it work.  The omelets were more on the fluffy side, tad rubbery, a bit over cooked and made with 3 eggs...I actually prefer a flatter - thinner omelet.  The water glasses and flatware  looked dirty as heavy water spots had to be wiped off.  On a more positive note, it has a very nice front for outside seating and the inside is cute, comfortable and contemporary.  Still...it actually looks like a nice addition to the shopping center.   Just leave yourself extra time when exiting the shopping center...it may take a few traffic lights to get out."
    },
    {
        "review_id": "KO-WyQkZ0Eh11XmnhyIcNw",
        "stars": 5.0,
        "text": "Went on a Saturday for brunch. 10 min wait. Great waiter. Fast service. Amazing food. 10/10 would recommend. Perfectly cooked eggs Benedict. Actually great coffee too"
    },
    {
        "review_id": "X_iAfWQcSezCvWX5cqg_7g",
        "stars": 2.0,
        "text": "Disappointing. Had high hopes for this joint and it turned out to be rather lack-luster... the service was awful, food bland, and order came out completely wrong. The menu sounds so delicious but when it came down to it was not worth the price. Better off going to Harvest which is in the same shopping center. I really don't understand how they remain busy - I would not recommend to anyone."
    },
    {
        "review_id": "jL6FDb_uQupsA0g2TH8bVQ",
        "stars": 2.0,
        "text": "Bright atmosphere, pleasant staff.  Menu is basically a small choice of expensive breakfast fare.  (AND they charge extra for real syrup!)\n\nFood was blah.  Thick, dry french toast, overly-salty potatoes, tiny portions of fruit cup.  The eggs were good.\n\nWon't return. \n(And the flies dive-bombing our food didn't help matters any/we dined indoors)\n\n*It' appears to be popular with people of that suburban mentality of that they are \"seen\" dining al fresco.  However, eating outside next to a Trader Joe's parking lot off the highway isn't exactly my idea of being cool."
    },
    {
        "review_id": "Y31-usImRyCb4KnB_vYH7g",
        "stars": 3.0,
        "text": "The food here was very good. I ordered the grand french toast. The environment is friendly and most people are as well. The issue and reason it only got three stars is the service. I ordered an orange juice and the group I was with ordered coffee for the table. We forgot we had ordered because a good chunk of tune went by. Then the waiter came back over and we reminded him of our coffee and orange juice. He did bring them out, but at the same time as our entrees. This was annoying because the drinks should've been the first thing out. The waiter told us, \"sorry, we didn't write anything down and completely forgot.\" Come on. I mean come on, what kind of excuse is that!? You \"didn't write anything down\"!? Anyway, the food I've had is great, and the orange juice was fresh squeezed and a lot of their other items are fresh. I would recommend the food, but man, the service was lacking."
    },
    {
        "review_id": "KIz0m65ligNSD_8cSkGu-A",
        "stars": 1.0,
        "text": "Really disappointed in the food and service. I had been to one in jersey and was very impressed, so much so that this is where we chose to have Mother's Day brunch. What a big mistake that was.\nI called at the beginning of the week to see if they took reservations. The woman I spoke with on the phone informed me to go on yelp Mother's Day morning, to skip the line and get in the seating rotation.\nSo that's what I did. However all morning I noticed that it was not allowing me to do so. I called the restaurant about an hour and a half before we had expected to go and was informed that they were not using that method today because of the holiday. I was also told that \"they had been telling staff and customers this all week in preparation for the holiday\".\nSo intern I felt like I was being accused of making the initial convo up. I explained how at this point, my family was not going to be able to get in anywhere unless we were willing to wait an hour because I followed the directions given by one of their employees.\nAfter speaking with the manager She was then willing to get us in the seating rotation (after at least 5 min of pleading my case).\nUpon our arrival the table was ready and waiting for us, Yay! And that's where the 1star comes in, and everything else from there went down hill.\nTo start my iced chai was warm, like really warm. I told the waitress (who was sweet) that I had an onion allergy so I was not able to have the potatoes. She said she would talk to the kitchen and sub in sweet potatoes \"that they use to serve\" when my food arrived I was given Salsa and chips. Well salsa has onions. I asked to just have the potatoes because there was no other suggestion and one of my children did not receive her potatoes with her meal so i would just give her mine, i guess they forgot to look at her plate before letting it leave the kitchen. By the time the potatoes arrived everyone was done eating, bummer. \nMy other daughter ordered fruit loops and couldn't even stand the taste of the milk, that's so strange to me. Milk is milk, but she basically gagged every time she took a bite. She's a cereal gal, so it was a bummer to see her disappointment.\nWe didn't want to bother our server anymore as she was clearly running around. \nNot sure if the restaurant was not ready for us, party of 7, or if it was because of the holiday. \nI had talked this chain up so much, and couldn't have been more disappointed with the outcome."
    },
    {
        "review_id": "VjujAT580Kb0DAjjGFR3Ww",
        "stars": 3.0,
        "text": "We ordered a 1/2 sandwich and ginger soup and french toast. The food was good, but service was slow/inattentive so that's why 3 stars. The waitress was friendly but never told us her name or checked back-we had to have others get her. Other waitstaff didn't look busy so maybe they should help each other out. The good thing was there was a small discount since it is a new restaurant."
    },
    {
        "review_id": "LNm2m6qu4hBHNnSm15ycTA",
        "stars": 2.0,
        "text": "Food is generally very good however the business appears to be run by kids. The host is disinterested and can generally be found on his phone while people wait to give their names. Some walk out because nobody pays attention."
    },
    {
        "review_id": "1CufHOW0Eozy4PjhiPbQVg",
        "stars": 3.0,
        "text": "Turning Point is one of my favorite places for breakfast. The food there is great and they have a lot of good choices on the menu. I recently went with two of my friends and our experience there was not so great. We walked in and were told that it would be a 15 minute wait for a table and we ended up waiting 45 minutes. When we got to the table the glasses for the water were dirty and when our server came to the table instead of saying hello she immediately pulled out her paper and just said \"all set?\" without making eye contact. The food came out quickly and was very good but the service was not so great. There was another server that kept staring at our table which made it very weird, we think maybe because she moved us down on the waitlist to get another couple seated before us (maybe family?)."
    },
    {
        "review_id": "shmhFcoV61mYVvv6wiiXqw",
        "stars": 1.0,
        "text": "Currently in restaurant  ... waiting 15+ min with no service.... stay away... zero customer service"
    },
    {
        "review_id": "ygcrlmNmjugYMZdRUaN4SA",
        "stars": 4.0,
        "text": "A great new place for breakfast or lunch.  Great coffee.  Delicious omelettes,  nice fresh fruit salads.  Some growing pains since they are so new...food took a long time to come out of kitchen.  Not exactly correct...but that's a part of training the new staff.  I would happily go back again and bring the kids.  Outside seating is a nice option."
    },
    {
        "review_id": "yjI4fR-SadokkVMecN4kwA",
        "stars": 5.0,
        "text": "Always an awesome experience here! Come here with my wife and we always leave full and satisfied with the service. She orders the avocado toast we get two of these and sometimes have eggs and a side. This is a great start to our Sunday mornings. We see other people order bowls and salads but we haven't upgraded to that just yet. This is our favorite place to go on a Sunday and sometimes we sit outside when its a nice day. But anywhere you sit is a great seat. The staff here is so welcoming and everything is very clean. Can't wait to come back with my friends and family."
    },
    {
        "review_id": "6RQkln5HANPI3S3NX3dQhg",
        "stars": 1.0,
        "text": "I have been to the Turning Point at this location a few times.  Each time just gets worse each time I go.  I have been to the one in Manalapan NJ and LOVE that one but this one where do I start with my dissatisfaction.  The wait even though we had to wait wasn't even an issue for me.  What is an issue for me is the lack of clean tables available when there are people waiting.  Then our server came and gave us menus.  She was quite pleasant but that is about it that I can say positive about her.  She obviously is not experienced she wrote things down but still couldn't bring the correct food out.  She also never checked in on us.  When she gave us the check I gave her my name and phone number so she could look up the Perks card.  She then proceeded to tell me that the card was $10.  HELLO I told you here is my name and phone number so you can apply this visit to my PERKS card.  Are you even paying attention?  \nWell lets talk about the food, if you order food you expect it hot.  You don't expect it lukewarm.  Also The Turning Point in Manalapan makes it a point for the food to LOOK appetizing.  The eggs looked overcooked for Over Easy, the avocado that was on my and my companion's meals looked as brown as the potatoes.  Honestly this was the most disappointing trip to this location and to think I was originally excited when this one opened up in my neighborhood. :("
    },
    {
        "review_id": "4HPoV8Ozg77zjdZm6Mf7fg",
        "stars": 3.0,
        "text": "The food is decent but the dishes have been dirty every time I've gone. The service isn't great and the experience seems very rushed, despite the food taking a long time and the waiter rarely checking up on us"
    },
    {
        "review_id": "gpXRncFk1TzbDD8O7Dvq9w",
        "stars": 3.0,
        "text": "Breakfast options here are great.  My only note is that the service model needs improvement.  Expect a little waiting but the food is delicious.\n\nWe shared the bacon lollipops.  Bacon wrapped around apples. These skewers of apples are protruding from an apple and the whole preparation is drizzled with maple syrup and brown sugar.  OUTSTANDING breakfast appetizer!\n\nHad the breakfast tacos which were on the special menu.  Really good!"
    },
    {
        "review_id": "mlt9-DwUXNT_Vvvro5tFnw",
        "stars": 4.0,
        "text": "Food was fresh & well made. Service was good - we sat at the bar stools.  Looks like it would be good for kids/families. They did a nice job catering to gluten free requests."
    },
    {
        "review_id": "Q1dWdLzhwLLqpfS7wXsmuA",
        "stars": 5.0,
        "text": "Disregard the low star reviews, they are all service related to the place being crowded. Food wise the place is great, coffee wise it's off the chart. Had Western omelette and the rest had caramel waffles, all terrific. Service was fantastic but it was 10 AM on a Thursday. Highly recommended."
    },
    {
        "review_id": "UCLcio7HYUugP2pKbji58A",
        "stars": 5.0,
        "text": "A quick note before the review: This place seems to have the most extreme worst/best reviews I've seen for local breakfast/lunch places. Keep in mind I went on a weekday morning when the restaurant was dead (about 10 AM) and it was just me and a friend, so our orders were small and simple. That would likely change on a weekend, with more people, and as the location continues to grow. Thanks!\n\nDecided to get breakfast here with a friend last Wednesday and really loved it! We were seated quickly and opted for a booth, though tables are also available. Though on the pricier side of breakfast (much more of a brunch place versus a diner breakfast), our portions (I got Grande Huevos Rancheros, he got Eggs Benedetto) were quite large and tasty - and they did not skimp on the avocado for the huevos rancheros (a whole half!) or was also nice to be able to order the eggs any style for the huevos rancheros - I ordered scrambled, which paired nicely with the other ingredients, so I'll be back to try other egg styles with this dish - it's that good!\n\nWhat really stood out was the specialty drinks, even for non-coffee drinkers like myself. We ordered the Reese's Hot Chocolate and Salted Caramel Mochachino to share and really enjoyed both. There is also a large selection of other coffees/coffee drinks, teas, shakes, and smoothies, which we'll also be back for.\n\nService was fast and friendly, and (likely because it was a weekday/there was no line and multiple open tables) didn't rush us out after we finished eating and continued to chat.\n\nCan't wait to go back!"
    },
    {
        "review_id": "CdxE4w33E__yKKje3AOzlg",
        "stars": 5.0,
        "text": "Went to this location with a friend of mine for brunch. We were there around 12:45pm on a Friday and we were immediately seated. The location was nice and quaint. Pretty packed for that time of the day. It's not that big but it's a nice size for a breakfast, brunch and lunch spot.  As expected the chicken and waffles were amazing. The staff was so nice and patient while gathering our order. The prices were exceptionally reasonable. I will definitely visit the location again."
    },
    {
        "review_id": "rjto3jNNZ4ABy5MB8i3ddA",
        "stars": 4.0,
        "text": "It took us about 45-50 minutes to be seated even though the wait was supposed to be only 20 minutes. The food was very good though."
    },
    {
        "review_id": "5XG0gU1Jn2ZL3zpUiGFHQQ",
        "stars": 5.0,
        "text": "The Popeye skillet was amazing!!! To top it off I had it with a toasted bagel!!! Great service and outside seating for spring or summer days!!! They even have complimentary coffee while you wait to be seated and even the coffee tastes great! Nothing bad to say about this restaurant! My wife and I will definitely be back with avengeance lol!!!"
    },
    {
        "review_id": "jlrm5sNt-WCF3g-Kvp8Stw",
        "stars": 1.0,
        "text": "Horrible experience. I looked on yelp to see the wait time and it said \"under 5 minutes\". Can't find anywhere that it says reservation required. When we arrived (very hungry) the hostess did not even greet us. She simply said \"do you have a reservation?\" We did not, so she turned us away and told us to come back in an hour and a half. It's a-shame she didn't offer us the take out option because we would have done that. My boyfriend and I were so turned off by the poor customer service we left. I used to love this restaurant."
    },
    {
        "review_id": "21slBXyQIu_PsQ8lYbCEng",
        "stars": 5.0,
        "text": "Such an original menu. I love that they give you a pitcher of water every time. It's gets packed so service can be slow but it's worth the wait. Reserve your table before going during weekend brunch!"
    },
    {
        "review_id": "ZYVr384rmnkz3ddlblxtGw",
        "stars": 5.0,
        "text": "We love turning point. As a family with young kids, were up early and usually get here before the crowds (9/9:30 on wkd is when the wait starts). Service has always been excellent and our food is usually gReat. Any time we've had any issue, it's been rectified easily and quickly. This place is a staple for us - kids love the s'mores waffles :) I love their fresh juice and healthy options. Sad to see so many 3 star reviews - given its always crowded, people seem to just be reviewing after 1 off visit, but it doesn't keep them from returning bc overall it's a great place breakfast and lunch, groups or not."
    },
    {
        "review_id": "Owsko3GaRDhlNWsjkuZQ8Q",
        "stars": 5.0,
        "text": "The food was delicious and the service was great! They bring you an entire pot of coffee! My kids loved their French toast volcanoes! They were provided with kids menus to color on and little containers of cereal to munch on while they waited."
    },
    {
        "review_id": "_laB9MYPWgMJ-zLRIp5Pbw",
        "stars": 5.0,
        "text": "My sister and I visited this new eatery on Saturday, 4/15, for breakfast. The menu had a lot to choose from. Just the drinks alone took up two pages on the menu. I finally decided to order the Grande Huevos Rancheros and my sis ordered the Wilber Skillet. We both enjoyed our food; the servings were pretty big and the food arrived quickly, especially considering it was very busy.  Overall, we were glad we gave this new restaurant a try: food is prepared fresh and the prices are very reasonable too. We will definitely return to try something else. Oh, I almost forgot - All customers received a \"New in Town\" 15% discount on their check and the check was delivered to the table by the manager. I don't know how long that discount will last, so I'd take advantage of it quickly."
    },
    {
        "review_id": "NveRS4Pu2sz4YAJB342cRg",
        "stars": 1.0,
        "text": "Horrible first experience here!  Definitely will NOT return.  My wife and I decided to try this place out and deviate from our normal breakfast spots, what a mistake.  We arrived and had to wait 15-20 minutes for a table for 2.  The college kids that are running the front of the house are not very friendly and really need to work on their customer service skills.  After we sat down and I ordered their 2 most popular items (peanut butter pancakes & huevos rancheros), it took 45 minutes for our food to arrive.  Before this we noticed that the water tasted like it was from the toilet and that the creamer container was disgustingly dirty.  The food quality was also poor.  The bacon was burnt, the pancakes were just edible, the huevos rancheros consisted of mainly potatoes instead of eggs and good stuff, and most disappointing was the huge black hair in this dish (see pic).  My wife made a quick visit to the gross bathroom before departure.  We could not get out of this place fast enough, my advice is to skip this place altogether if possible!"
    },
    {
        "review_id": "Tqwm99IUIagqHo8Fi_7ong",
        "stars": 4.0,
        "text": "Been here multiple times for breakfast and everyone left happy. The food is awesome and the selections of unique blends of coffees and teas are a plus. Service is fast and the servers are friendly. There are some vegetarian options and so far have yet to be disappointed."
    },
    {
        "review_id": "r3DYFtWhHf4SqpLtYAZUow",
        "stars": 5.0,
        "text": "Turning point is a great addition to the otherwise lacking breakfast arena in the North Wales, PA area. There is a good amount of shopping in this area with the Montgomeryville Mall down the street and The Shoppes at English Village (which include a brand new Sephora) where Turning Point is also located. This is a fast growing franchise with three other locations in PA and a new location coming soon to Newtown, PA area.\n\nWhat I love about this place:\n\nFrench Press Coffee! If you have not had it, your missin' out.  Kenyan, Hawaiian Kona, Costa Rican, and Jamaican Blue Mountain.  They serve in a large french press carafe enough for two with a rock candy sugar stick (even though I smuggle in a napkin home for the kids) super cute.\n\nExtensive breakfast and brunch list waffles, pancakes, french toast, egg skillets, avocado toast, the list goes on. My favorite is the Popeye skillet and the Wilbur Skillet extra avocado. Lunch options are savory sandwiches, salads, and create your own combo with 1/2 sandwich, soup, or 1/2 salad (choice of two).\n\nOutdoor Eating:\n\nThey have a great patio area out front so on a sunny day enjoy your coffee with some fresh air. \n\nWhat could be a little better:\n\nThe wait time can be brutal and there is no calling ahead so if you are a big party or in a rush...don't get your britches in a bundle cause your gunna wait. Grab a cup of FREE coffee in the waiting area and stare at your phone or perhaps have a conversation. Its a good sized bright space with lots of natural light. Just realize that you may have to have some patience.\n\nOverall a great spot. I've eaten here several times with the family and I'm sure we will be back for several more!"
    },
    {
        "review_id": "jfkS77m0KI8TSE8uK8g8HQ",
        "stars": 5.0,
        "text": "I really cannot complain about anything regarding my experience to turning point this past week. I read the reviews before I went and saw that poor service was frequently mentioned. But I have to say, our service was great and I have nothing to complain about! Our server was Alex and he was great. He was very attentive to us and our multiple different requests (lol we're picky). The manager Frank also stopped by our table to see if we needed anything which was also very nice. Now onto the food-all I can say is YUM. I got the pancake flight and got 6 amazing pancakes for a decent price! The vegan pancakes were the best by far. We also got the avocado bacon skillet and it was DELISH. I have really nothing I could complain about regarding the food. We had a great experience and will definitely be back!"
    },
    {
        "review_id": "RtaCfmA4BSmhQhO2256ukQ",
        "stars": 5.0,
        "text": "Avocado toast! You need to get this me and my sissy split it. \nI ordered the create your own combo. Sooo good everything here is soo good. First time sitting down here i always get take out. This is my faveeeee place to go to get avocado toast! Its so heavenly. The wait was 20 min on a Sunday afternoon  so worth the wait! These pictures are still making my mouth water! Friendly staff members! And the vibe is so homey"
    },
    {
        "review_id": "PcX2F0Fowd96vJRwnalU9g",
        "stars": 1.0,
        "text": "Over priced. Food undercooked. Silverware dirty. Forgetful server needed to be reminded several times (young & unprofessional). Noisy environment. Cannot understand why anyone would come here twice."
    },
    {
        "review_id": "wQPCOYTPAvC69C_Q0MvmqA",
        "stars": 5.0,
        "text": "Beautifully presented fresh food, great chili, and a very helpful server make this an easy place to like.  We'll be back."
    },
    {
        "review_id": "N1tYrstTLQyBQ9C6Gm1NpA",
        "stars": 3.0,
        "text": "First time eating her on Saturday morning for breakfast. Loved the decor and the restaurant was very clean. The waitress took awhile to greet us and then seemed to disappear for 10 minutes. Breakfast came out cold but over all the food was good. Both the waitress and another server came back three times asking yo clear our table though there was no one waiting yo be seated. I felt like I was bring rushed to leave."
    },
    {
        "review_id": "rak6ESPDD1Wx6aRbET9hWg",
        "stars": 4.0,
        "text": "LOVED my visit to Turning Point this past Wednesday.\n\nSpur of the moment stopped by with my dad, sister, and her kids - with plenty of seating available both indoor and outdoor. Indoor was freezing so we decided to sit outside. Not too many tables, but just enough! I'm sure a Sat+Sun here is crazy crowded.\n\nOur waitress offered to make a table for us and immediately brought over lemon water for everyone. Besides water I ordered an ice coffee. It was pretty good and fairly strong. My niece ordered the Summer Raspberry Spritzer and loved it. It was served with a mint ice cube as well. had plenty of time looking over the menu and let me tell ya, everything looks awesome. Literally everything. So many different options including a good amount on the 'healthier' side.\n\nWe started off with the Bacon Lollipops, but they unfortunately came out with the entrees. Although I didn't indulge in any they looked crazy good. Presentation on point as well. Entrees ordered: \nChop Chop Salad, Shrimp Tacos, Traditional Eggs, and I ordered the Pesto Infusion Skillet filled with tomatoes, avocado, and portobellos. Everyone enjoyed their meals. I especially loved mine and definitely recommended it if you like egg whites. There are tons of Turning Point locations so I highly suggest stopping by one of you ever get the chance!"
    },
    {
        "review_id": "71lCkWz9rGE1Pk1FdDWc5A",
        "stars": 5.0,
        "text": "I'm not really sure why this place has such bad reviews. We went on a Wednesday morning and our service was awesome ! The food was absolutely delicious!! I got the benny special with shrimp, my friend got a skillet, and my boyfriend got the chicken and waffles. It all came out pretty fast and the restaurant was really busy! I live in mass and all my family is in philly so we will be back again (:"
    },
    {
        "review_id": "Sq5KFnhmmz1q65s3PflfsQ",
        "stars": 5.0,
        "text": "i loved this place, my first time there today.  i was HORRIFIED tho when they brought plastic take out containers for leftovers and plastic baggies....so sad.  even the historic spring house tavern changed over to earth friendly take home boxes made of cardboard.  i hate to say it put a bad taste in my mouth cuz i loved everything else about it.  my lunch was easily made vegan and was delicious and hearty."
    },
    {
        "review_id": "framUoQj4X_Oc9j8_a_S-w",
        "stars": 5.0,
        "text": "I took my wife and two young children there on a Sunday morning. Having an infant and toddler is a challenge to deal with at a public restaurant at times. Our waitress was fantastic and really was great to the kids. She really made us feel at ease....for something that can be stressful as a parent. \n\nThe food was great!  The huevos rancheros were perfect. The chorizo, cheese, potatoes, and eggs all blended together perfectly. \n\nThe rest of the menu looked great too with many more unique items. It was a tough selection. My daughter had pancakes and they were fantastic. Not too heavy. \n\nI will definitely go back. I would recommend getting there early though. We got there around 830 on a Sunday and got a table right away.  When we were leaving around 945, there was a line to get seated. Well worth it though!"
    },
    {
        "review_id": "6mqdeMPwfAUour-cso3HAg",
        "stars": 5.0,
        "text": "I'm very surprised by the negative reviews on both food and service. Mh mom and I are major foodies and this is our favorite spot for Sunday Brunch! I've been here many times, both at this location and the one in Warrington and have had nothing but great experiences. \n\nI definitely recommend calling ahead to check I'm wait times or make a reservation since they're always packed regardless of what it says on yelp.\n\nTheir coffee is excellent and they've got lots of fun flavored lattes and oil scented French press coffee. Service is usually excellent though when they are really slammed it can be on the slower end. But the waiters and waitresses are always so friendly, accommodating and apologetic if they're extremely busy.\n\n\nI got the I Can't Believe They're Vegan Pancakes and couldn't agree more with the name. They were delicious and definitely didn't taste like they were missing eggs or buttermilk. So yummy! My favorite thing to order here is the Big Easy Benedict. It's delicious with the cornbread! Other great menu items are Grande Huevos Rancheros, Salted Caramel Waffle, Tuscany Omelette, and and their El Fresco Quinoa Bowl. And my go to latte is the Nutty Irishman. \n\nHighly recommend you give this place a shot just be sure to call ahead and expect it to be busy!"
    },
    {
        "review_id": "XuNwDwk-7KDDIh2p2qoyVQ",
        "stars": 5.0,
        "text": "Awesome food, great selection, delicious drinks. Pricey, but worth it as an occasional treat. Just be prepared for a wait."
    },
    {
        "review_id": "Bo1lt7I2fldC8JPceCqcnw",
        "stars": 4.0,
        "text": "The food here is fresh and good. The turning point is packed on the weekends but worth the wait. It has a family friendly atmosphere."
    },
    {
        "review_id": "PnqDAlcL2-S9oOgn34Lzkw",
        "stars": 1.0,
        "text": "\"Who's in the kitchen and why can't they do their job?\"\nReviewed 2 days ago NEW\nI had high hopes for this eatery but I got over that with just one visit. Arrived a little after 12p.m. on a perfectly lovely day with four other adult family members. The restaurant makes a nice impression with it's white beadboard trim and large windows. I'm thinking this is going to be nice. We were seated fairly quickly once they had converted a square table to round to accommodate our party of five. The waitress was friendly and attentive at first. Took our orders, poured our beverages etc. Tick, tock, it took 45 minutes before our food was served! If 5 is a big party, they are in big trouble. But the fun doesn't stop there. Out of 5 entrees there were 3 errors. Mom asked for sausage, she got bacon, Sister asked for multi grain bread, she got sour dough, hubby ordered a Tuscany omelet and got a Western. My tuna melt was accurate but miserably cold. Okay let's go with 4 out 5. My brother-in-law was happy with his Cuban. We're still trying to figure out how that happened. My advice, skip it!!!"
    },
    {
        "review_id": "oIyf7WMfbYUVEQTnUYafEQ",
        "stars": 1.0,
        "text": "Yea. So this place looks good. Wait staff is super nice. Atmosphere is good. Brand new. Super clean. But why does the pancakes taste like card board? Eww.  What is that I'm eating ? Am I supposed to eat this wrapper?  Nasty pancakes  orange juice to tastey. Coffe is nice and strong.  Truly a disappointment really"
    },
    {
        "review_id": "wQ728a1oQTq5noV0glxy-g",
        "stars": 5.0,
        "text": "This place is seriously incredible, I have never felt better eating their food. Most places I leave feeling bloated and gross because of the grease. But this place their food is so good and there is no grease that you leave feeling you had the best meal of your life and full. I will back!!!"
    },
    {
        "review_id": "5Ms2MDGy496km1ZUtrqpKA",
        "stars": 3.0,
        "text": "I have been at this location several times, and in the past it was excellent, although the last 3-4 months something has changed. Standards went down? Management changed? Not sure. I always get the same thing so I am aware of what COMES with it. Apparently, no sides of fruit comes with breakfast items anymore, (or at least that's what I was told) they took away the skillets, quality of food went down.. maybe change the menu accordingly. Service is much slower than Blue Bell location.., which I wouldn't mind, but the overall experience has not been the same. It's unfortunate."
    },
    {
        "review_id": "RxFzeqmEsc-lKqn5VsMnGw",
        "stars": 3.0,
        "text": "This place is OKAY. Maybe I should try a different location but this place is just average to me. Moving down to ATL the brunch scene there is insane so I might be a little biased. I ordered the flight of juices which was in my opinion the best thing as well as avocado toast. The avocado toast was sad and had no flavor I could've made it better at home. The skillets looked amazing and fulfilling as well as the Eggs Benedict."
    },
    {
        "review_id": "5Kpj63PBsP3GYI49_swcmQ",
        "stars": 3.0,
        "text": "First time visit on Friday. Service was very good. My guest had a wonderful omlett and really enjoyed it. I had the classic eggs Benedict. It was ok but I would recommend they  serve the English muffin much softer. Mine was hard to cut and chew.  Atmosphere was very nice."
    },
    {
        "review_id": "O_SLKqCzhCDlGzLVWxgsjQ",
        "stars": 5.0,
        "text": "All I have to say is, look at the pictures... yum, yum, yum! My mom loved her Corn Bread French Toast and the Chocolate Chip Shake-A-Chino.\n\nI devoured half of my Pancake Flight (Cinnamon Roll Pancakes, Berry Chocolaty Pancakes, and Lemon Blueberry Dream). \n\nThe portions are very big, so yay to leftovers!"
    },
    {
        "review_id": "oIm9ATBkiWBFDWYHwa3tIA",
        "stars": 2.0,
        "text": "The waitlist and yelp check in is a joke. Got on the yelp waitlist almost an hour ago. It said 15-30 minutes. I arrived 20 minutes later and checked in at the front desk. That was 30 minutes ago and we are still waiting being #6  on the queue. Not only that but all the people waiting are packed into a tiny vestibule."
    },
    {
        "review_id": "sehYQmHFIZTNDAOEZcyg5w",
        "stars": 1.0,
        "text": "What a mess. Let me start by saying I've been to the Turning point in warrington 3 times before and loved it. I live in ambler so I was so happy to see one opening less than 10 min down the street from me. This morning I went around noon and was horribly disappointed. \nThere was no wait and I was seated right away, the waitress was very nice, I ordered a Wilbur skillet with poached eggs and an iced coffee. The coffee came pretty quick and then in a reasonable amount of time my skillet showed up. \nMy \"poached eggs\" that had a yolk that was harder than the yolk of a hard boiled egg were sitting atop some dry ass potatoes with cheese that had crusted over. I grab the waitress and told her the eggs were beyond overcooked. She asked if I wanted new ones and I said just bring me 2 poached eggs. She said no problem and she would have the \"manger\" come over. Before he did the waitress brought me out a new order of poached eggs. This time, comically, they were the same as the fist batch....hard boiled!! At this time the manager, who looked like a disheveled man who had no clue, came over to tell me I wouldn't be charged for my skillet. I said I hope not and by the way this isn't a poached egg either and showed him my replacement egg. He said yeah i guess that is a little overbooked and WALKED AWAY! Great manager. \nI felt bad for the waitress who tried her best to cover for all the mess ups. But after 2 failed attempts I ended up leaving hungry. Basically you would be better off eating elsewhere."
    },
    {
        "review_id": "dd9cRmOeRzRtFrxAeexsbQ",
        "stars": 1.0,
        "text": "I have been working in food service for 23 yrs and this had to be one of the worst experience I have ever had at a restaurant. After waiting for 25 min to be seated, the server spills coffee on us within min of being seated. The server complains that he burnt himself with no acknowledgment that he hit both myself and my guest, including getting it all over my guests pants. 20 min later he finally comes back to take our order. We waited for 40 min and never recieved our food. The server finally comes out and says the messed up the order and are remaking it. The manager comes out says they will comp the food, but we can pay for the coffee (that was spilled on us!) We waited an additional 20 min and still did not get our food. People that had been seated after us were served and leaving at this point! At least 10 tables were served while we waited. We finally got up after an hour and told them we were leaving. They still made us pay for the coffee...$12.10!!\nWill never return!"
    },
    {
        "review_id": "ZQTyAvFfjDaxLTskCXQUyA",
        "stars": 2.0,
        "text": "This was my first time at Turning Point; my sister and I had a day of brunch and shopping planned, so despite the reviews suggesting poor service, I decided we would give this place a shot. The poor service reviews were definitely accurate. When I checked Yelp just before 10, the wait time was only 5 minutes, so I decided we didn't need to join the wait list. We arrived at 10:30 and were told the wait was 30 minutes, so we decided to wait. The only reason we did so was because on the patio, about 8 of the 10 tables were empty, so we thought the wait would be shorter than 30 minutes. We also specified that we wouldn't mind sitting outside if that was first available. This was a pleasant, sunny, 75 degree Sunday morning, so we thought it was very odd that people were not being seated on the patio. We moved up to 12th in line on the wait list, and there were still just as many empty tables available on the patio--it seemed like no one was being seated out there, but there was no explanation given. At one point a couple just walked right up and sat down on the patio, they didn't give their name for the wait list or see the front desk first, just helped themselves. The waitress seemed to be telling them they shouldn't have done that, but then she took their orders and served them. Another couple walked up and greeted the waitress (without going inside first) and she sat them right down on the patio--at that point my sister and I started to wonder if you had to be friends with that waitress to get one of the many open tables on the patio. \nOur wait was a little over 30 minutes, and when our table was ready, they called the completely wrong name--I had to confirm it was me using my phone number; I would've gladly spelled my name if they had asked. We had already checked out the menu, so we ordered and our food was served pretty quickly. The food is amazing--my sister got the pesto skillet with veggies and egg whites, I got the yogurt granola bowl, and we shared the pumpkin pancakes because they just looked and sounded irresistable--and they were! \nOur server cleared some plates and left our check, and then disappeared. We kept looking for him, trying to get his attention, but he wasn't coming anywhere near our table. We waited so long that we actually thought maybe we were supposed to pay up front, so we walked up to pay, only to be told \"you pay with your server\". At one point he went outside, and when he finally came back in we were able to flag him down and pay. \nAll in all, food was great, service was poor. I don't mind waiting if it's clearly busy, but when there are at least 8 open tables (cleaned off also) and no one is being seated there, the wait seems unnecessary. And the wait to pay was ridiculous--we wanted to get to the rest of our day and were held up for over 15 minutes just to pay the check. Keep the menu, fix the service! Until I see some reviews that show improved service, I won't go back."
    },
    {
        "review_id": "7eQy11PBSRXX8lqm7RLTdw",
        "stars": 5.0,
        "text": "SO GOOD. I am visiting a friend and we stopped in for brunch. I got the chocolate chip shake a chino and the Wilbur skillet and they were both amazing!!!  it was the perfect morning breakfast."
    },
    {
        "review_id": "KZ2iv7bVjGaS9Ay_YS7Xkw",
        "stars": 2.0,
        "text": "The waiting procedure is very bad. There doesn't seem to be a rhyme or reason to the actions of the seating czar and her mighty iPad, who by the way is very soft spoken when it comes time to call out names. She almost seems annoyed to have to do it."
    },
    {
        "review_id": "jzSdFO7rvqB0RrTkVuAx6A",
        "stars": 4.0,
        "text": "For some reason I'd avoided all the Turning Point locations (there are a bunch of them), but when my friend suggested it as a half way point between us, I decided to finally give it a try. Super glad I did!\n\nBecause this place focuses on breakfast, there's a large, diverse menu (huge plus for a picky breakfast eater like me). Even better - there's a great selection of hot teas, which come complete with a personal pot. We opted to split the avocado toast and lemon-blueberry pancakes.  Both were so good I am already plotting when to go back. \n\nService can be a little slow, although our waitress was super friendly. Was happy we got tucked in the back room, because the main dining room seems a bit loud."
    },
    {
        "review_id": "M3rgxvNrv698XeGbSW1vFA",
        "stars": 1.0,
        "text": "Just had to leave after sitting for 30 minutes with only water. Terrible service. We were sat at a dirty table, server didn't greet us for close to 10 minutes, and then never brought our coffee. We told the manager why we were leaving and she didn't even try to make it right. We won't be back."
    },
    {
        "review_id": "Yb_SYAIHSQcEsDdb3t3odQ",
        "stars": 3.0,
        "text": "Underwhelming.   Food is ok.  Service is standard.    We got in right before the Sunday rush.  No way I would ever wait more than 10-15 minutes for this place, esp when I the same shopping center I can get lovely brunch with delicious cocktails,  more space, and overall better service \n\nI stopped going to the warrington location for this same reason.   Guess NW is out now too."
    },
    {
        "review_id": "ENPzFmzdrIsDGOGnGYhTUA",
        "stars": 5.0,
        "text": "Never disappoints. Sinful Delight French press is always a winner. Everything I've tried has been amazing. Sad they took breakfast nachos off the menu because they were a favorite. But so many other awesome choices."
    },
    {
        "review_id": "nANxYUQrR0klNoukprI_hQ",
        "stars": 3.0,
        "text": "Enjoyed a solid brunch here Saturday.  Has both indoor and outdoor seating.  The food is excellent, the menu is creative, the service was good, but the prices are a little steep - hence 3 rating..."
    },
    {
        "review_id": "wEKJ683lQ-lTZMdMGzOe6A",
        "stars": 3.0,
        "text": "3 stars mainly because the chai tea latte I got was phenomenal. Pretty much everything else was just okay. We are big foodies and typically expect more from meals when sound amazing on paper. Everything was just alright. My daughter got the s'mores waffles and they had hardly any flavor. Plus you had to pay more for real maple syrup?! You're kidding me.  The waffle tasted like nothing and it was unsatisfactory to say the least. I got one of the egg skillets which sounded really good but was also very unsatisfying. The eggs were dry and the potatoes lacked flavor. follow through is not great here. Don't get your hopes up. Not at all worth the wait."
    },
    {
        "review_id": "1cgACWdMk0EYrwsJxs2Diw",
        "stars": 5.0,
        "text": "A big shout out to the servers and management at this restaurant. After we had a wonderful meal my mother fell in the bathroom. The staff was attentive,compassionate and helpful. \nThank you for everything!"
    },
    {
        "review_id": "XGlGDtZHQ3l2l5_6g6A6MA",
        "stars": 1.0,
        "text": "Literally, the worst meal I have ever been served.  I ordered an egg white \"skillet\" and received  three tiny pieces of avocado, 2 Tablespoons of raw red onion, a few very old leathery pieces of mushroom, some canned diced tomatos and egg whites that were supposed to be \"pesto infused\" but were simply slightly green.  I think this probably cost about 1.00 to make and the fee is about 10.00.  I did not complain, my mistake, as I was someone else's guest and did not want to be rude.  \nAwful !!   I won't even discuss the service but just ready the other reviews and you will get the idea.  The only saving grace were the cute little containers of fruitloops that I shared with my table."
    },
    {
        "review_id": "D2U7n4SL-wpS9dNe2Jqadw",
        "stars": 5.0,
        "text": "Hosted a Sprinkle Baby Shower for my daughter at Turning Point North Wales on Oct 13th, everything from start to finish was excellent!! From speaking to the manager Frank while planning stage to when we all left after shower with huge smiles on our faces! Our extraordinary server in charge was Alex&he set up the private room to perfection for our needs, always ready to do or get anything needed. The ordering process for the 14 of us was extremely easy, our meals came unbelievably quick&as always the food was delicious,too notch! We all had a wonderful time especially my daughter who absolutely loved it all. Thank you so much Frank&Alex for all you did to help me give my daughter a very special day to celebrate the newest lil peanut to our family...Kathy Grosso"
    },
    {
        "review_id": "UUsoouujZhEXWlfvpxhagg",
        "stars": 1.0,
        "text": "My experience today was awful. The service here was a mess. I got seated and then the host said she would be back over with menus. 10 minutes went by and not one server came up to my table and I did not even get menus. I had to get up and ask for menus. Finally a server came over and asked for drinks and another 10 minutes went by and still no drinks and our waiter was making a milkshake and waiting on other tables. My party and I decided to get up and leave. It was not crowded like usual there and the service was horrible. I signed up for the waitlist at 10 and then got seated at 11:25 and then I ate somewhere else and ended up eating at 12:30. So it took over 2 hours to finally eat something."
    },
    {
        "review_id": "FshVvMemeWAiIfb66lyqfg",
        "stars": 5.0,
        "text": "This is one of the best places to eat if you like a nice light/heavy breakfast. It's also Vegan friendly and there team is very exceptional, and there one server Dan Foore is one of the most friendly servers in the establishment. Had a great time would definitely recommend to friends and family."
    },
    {
        "review_id": "ToJIZC42hHC7ATAyoVJ5BA",
        "stars": 1.0,
        "text": "I have to say....we really want to like this place....the food is terrific...coffee is delicious....BUT....the service is just awful...just awful....awful, awful, awful...we've given this place a few tries, but every single time without fail the service is just horrendous...the owners need to get this right or this place won't last....my wife comes from this industry and she has a hard time justifying even tipping because of how bad the service is....it's a real shame"
    },
    {
        "review_id": "2i4E7DaNFetRxdbyEt69yg",
        "stars": 2.0,
        "text": "I love the Turning Point but the older hostess with the ponytail is rather rude.  The wait process is obnoxious. If I come in and wait 45 minutes it's not fair that call ins can just come and get seated after I've already waited close to an hour.  Makes no sense."
    },
    {
        "review_id": "xg2o4XzO77NQi9utKmNnEw",
        "stars": 5.0,
        "text": "Had a couple meals at this location and the food has been delicious. I'm a little obsessed with the French pressed coffee and it makes a difference !\nService is always on point and actually seem to like their jobs! The manager always is around and checking in on things. The classic Benedict is delicious and the sauce is delicious. Love the farmhouse chic."
    },
    {
        "review_id": "ZWTplkgnO1-Pf1E3wxLJ9g",
        "stars": 4.0,
        "text": "This place is little busy but worthwhile wait with drinking free organic coffee in the waiting room. Food is great with avocado omelet. Much better than typical IHOP but little expensive for breakfast store. We will go there anytime for brunch"
    },
    {
        "review_id": "BahbZu5ufhRekeP6miE9oQ",
        "stars": 1.0,
        "text": "In North wales manager was extremely rude to a pregnant woman with a toddler who was waiting for a table. \n\nHe was extremely disrespectful and unprofessional. \n\nWorst experience ever in the restaurant."
    },
    {
        "review_id": "4jG0Uc7nHXpZarEWNSDxIA",
        "stars": 4.0,
        "text": "Always a good go to breakfast that's reliable. No complaints just good food! Portion size is always bigger than the price!"
    },
    {
        "review_id": "2MHeRARfIDYR8s2th2vuuQ",
        "stars": 2.0,
        "text": "Food is great. Manager was incredibly rude when I was asking for a table. Will not return to this location simply because of how disrespectful he was. I have never written a Yelp review before but could not let this go unnoticed. I highly recommend the Blue Bell or Warrington locations."
    },
    {
        "review_id": "zeS9svBnqG4lYjzqH87_Qg",
        "stars": 1.0,
        "text": "Everyone has been taking about this cute new little place in North Wales called the Turning Point.  This is actually our 2nd time there and the first experience was ok, and we realize there are kinks they need to work out so figured this time it would be great since it still gets packed right? Wrong!!!!\n\nOnly thing turning here is my stomach.  I ordered the NY Deli omelet and if anyone knows anything about NY Delis they give you a shitload of food.  Girlfriend ordered a No Yolks About It omelet.  \n\nWaitress was very nice and she felt bad and offered us snacks 45 minutes after we ordered.   We asked for straws for our water and after about 15 more minutes we asked someone else.  After another 10 minutes I got them myself.  I guess straws can be confusing.  Not to mention every single server and hostess looks under 21 and the General Manager snapping his fingers at people and wasn't very helpful\n\n So after almost an hour we got our food.  My egg whites were clearly not egg whites and do you think they gave a decent amount of pastrami?  Nope!  There was enough pastrami in there to not please my cat.  They put the cheese on top to probably hide the fact that it was scrambled.  Additionally the potatoes, which I asked to be extra crispy were soft enough for a 130 year old person with no teeth to eat.  \n\nThe no yolks omelet comes with a hint of cheese.  There was enough cheese to satisfy a horse.  Also fresh salsa, which was hiding in the omelet and not fresh.  We would have sent it back but probably been there another hour.  \n\nGot the check with our food and asked about the 15% discount for my development and the person at the cash register looked at me like I have two heads.  Then she grabbed the waitress for me to pay since I can't pay at the register.  Still left 20% tip.  Not totally her fault and she was nice.  \n\nOverall, this place might be a cute little spot in a shopping center with Trader Joe's, Harvest and Iron Hill, but it is actually the asshole of the shopping center.  Save your money and stick with Pumpernicks if you are looking for breakfast in North Wales."
    },
    {
        "review_id": "GKl2sKn8MJygx0wjUHEbhQ",
        "stars": 2.0,
        "text": "Very good service. Eggs Benedict was served to me with an uncooked egg. They wanted to replace my meal but I was grossed out with eggs. \nDisappointed to say the least. \nUsually enjoy my mess as immensely. Have the same thing every time. \nNot sure I can eat it again."
    },
    {
        "review_id": "EHcacdg_Rgg6kMCWE7qXBQ",
        "stars": 2.0,
        "text": "Not great- iced coffee had about 3 ice cubes in it so it was like warm, my eggs were not cooked thoroughly and the whites were runny, my partners plate was dirty and had salsa spilt on it (salsa was not part of his dish), the table and menus were dirty, and there was just a rubber mat on the table soaking wet and overflowing w dirty water. really gross. won't go back- we were surprised there was a 20 min wait for this place..!!"
    },
    {
        "review_id": "4rCfuCea4Aei7ii2vKYblw",
        "stars": 3.0,
        "text": "Food was great just wasn't hot when it came out. It was lukewarm.  Portions were nice loved the Belgium Waffle"
    },
    {
        "review_id": "Z97Ws_VMDoHzgv7oIaoA0g",
        "stars": 2.0,
        "text": "I will say the food at turning point never disappoints. However, this location at North Wales has been having issues with service the past 4-5 times my husband and I have gone there. It seems like every time the servers and management don't coordinate well. Now let me just say, we have been to turning point (in different locations) multiple times with friends and just by ourselves. So we know what to expect from the food, and how it should taste.\nNow that being said...\n\nThis time we went the server was very pleasant and took our drink order first.  It wasn't until about 20 minutes later that our server came back around to take our entree orders. The coffee for my husband came out quick (it should..hello coffee). I still had not received my latte drink from the drink bar. When it finally came out it was the wrong drink. I knew it was because the server who brought it out said, \" Coffee?\" I ordered the nutty Irishmen latte (which is a wonderful drink) which is not a coffee. So when I was told it was a coffee, I said that I had ordered a different drink. The server told me, \"yea it's what you ordered\" \nI took one sip of it and knew it was wrong. It was a coffee. So rather than talk to our server and wait another 30 minutes to get a drink,\nI went up to the bar personally and asked if it had certain ingredients in it that my drink was suppose to have. The server at the bar stated he had made it with almond milk just like I wanted. I then asked again if he had made the drink I wanted (the nutty Irishmen) and he finally said no it's a coffee. I don't know where the miss communication was, but for me to have to go back to the coffee barista who made my drink, and for him to continue to tell me that my drink was made right, and that I was wrong, really annoyed me. I'm sorry but I have been to turning points (in multiple locations) enough times to know what my drink is suppose to taste/look like. \n\nAnother note with this location, the servers had to clean there own tables which slowed the process of getting a table when we first came in. The manager or front house hostess (whatever their title is) didn't do a great job of helping out the servers. At one point I saw him sitting on the floor behind the cashier/hostess desk on his phone. I have never owned a restaurant business, but I know well enough that if you aren't busy, and tables need to get cleaned...help out! Team work makes the dream work, and your customers happy. \n\nOur time frame from sitting down at the table to finally finishing up our meals was about an hour/maybe a little longer. Usually when it's just my husband and I we are out/done eating in 45 minutes. Thank goodness we weren't in a hurry to go anywhere.\n\nSo to anyone who is willing to wait a while and possibly not get the right food/drink you can come here. My recommendation is to go to a different turning point. This location has been awful the past 4-5 times we have been there."
    },
    {
        "review_id": "IRcVeq0gLzernIEWlTv2MQ",
        "stars": 5.0,
        "text": "Best brunch menu around. Something for everyone. Sweet,savory and healthy. And all delicious."
    },
    {
        "review_id": "BDgE5GN-HOUZYj3DQUY6SA",
        "stars": 1.0,
        "text": "Ordinarily I would be hesitant to review a restaurant in its early stages of opening but seeing this is part of a growing family locations they should know better. \n\nRestaurants live and die by their leadership and this location lacks the quality and standards that prevail at their other locations. \n\nThe wait staff is friendly but require more training and experience. They are a primarily younger crew so they require the aforementioned guidance is a necessity. \n\nThe menu paints a good picture of a delicious well-prepared meal, but unfortunately the follow through of the kitchen staff didn't live up to their menus descriptive dishes. \n\nIf you can't poach an egg, don't offer a variety of eggs Benedicts. \n\nIf a dish gets sent back because the eggs are over cooked, make sure the replacements aren't the same over cooked mess. There is no excuse to present a repeated mistake. \n\nAnd if someone says the manager is going to come by or make sure everything is ok, that actually needs to happen. \n\nThe management here needs to be present and not so lackadaisical. \n\nPlus, it's breakfast, it's not that hard."
    },
    {
        "review_id": "1zPXyHTueedwHWThRXRKmg",
        "stars": 3.0,
        "text": "Good food, considerable wait time. Very nice staff however, very slow service. Loved the French toast, and nice to have breakfast and lunch available all day. It's a very busy restaurant so I'd recommend arriving earlier."
    },
    {
        "review_id": "Wr_jR9--taQIjnMvzGitgQ",
        "stars": 1.0,
        "text": "Constantly mismanaged and does not understand how to evaluate employees. Most are grossly incompetent and unable to show efficiency or a desire to be better. Menu is great but the staff can't deliver. Recently ordered doordash and they forgot an entire item and clearly don't understand packaging."
    },
    {
        "review_id": "CmwXNW0dip4CEyabhaSPAw",
        "stars": 1.0,
        "text": "Please save your money and go somewhere else! The servers were young, untrained and super forgetful. We were seated right away and it took exactly an hour for us to get our food. \n\nOur server was very sweet and apologetic after 10 minutes of being there and that's when we knew that our food was going to be a while. Through out the hour, she came over at least five times to apologize and offered us chips as a snack. It was a nice gesture but not something I would want to eat at 9 AM. \n\nI ordered the \"no yolkes\" about it omelette that was supposed to have spinach & tomatoes inside the omelette with salsa on the side. They managed to mix it up where the salsa ended up in the omelette and the tomatoes on the side.  The omelette was supposed to have a hint of cheese and they managed to put a slab of it on. You can refer back to the picture I posted with the sliced tomatoes on the side."
    },
    {
        "review_id": "R4V-uFxRwP_4yJCsJqJ8Xw",
        "stars": 3.0,
        "text": "The service was amazing. The food-meh. After a long morning of thrifting we decided to stop here for breakfast. \n\nEverything is digital from the reservations, to the menu, to paying your bill. I actually like this convenience but it may not be for everyone. The wait was a little long but given its location (not many other brunch options available) and the day (Sunday) it was expected. They text you when your table is ready so it's nice to be able to sit in your car. \n\nThe menu was super easy to pull up on our phones and everything seemed promising. Everything reads so delicious and even some photos but it was so underwhelming I could have gotten better breakfast from the corner store. I was with 5 people and most of us didn't even finish our food. We all decided to order hot chocolate because it was freezing outside but that was a mistake. It was literally water that had a chocolate tint. Swiss Miss Hot chocolate costs $1.79 for an entire box and it tastes better than this. \n\nPayment and splitting the bill was easy as well. Scan the QR code, and the option to pay for your order or to split was right there. \n\nHonestly, skip this place for brunch/breakfast and drive a few more minutes to somewhere else because it's just not that good."
    },
    {
        "review_id": "SP32nOhRm-KRAjYMPgf_MQ",
        "stars": 3.0,
        "text": "Stopped in for lunch on a Sat afternoon and luckily we were seated fairly quickly. Service was fine and the portions large.\nChocolate chip pancakes were a little soggy.\nThe Turkey melt was good as was the chopped salad. \nThe Chicken with waffles was several chicken tenders with 2 waffles and some strange kind of gravy on top. If I had known I would have asked for the dish without the \"gravy\". Nice selection of teas and coffee's and the prices are reasonable."
    },
    {
        "review_id": "VEr-66THUXitFLOLyjAgOA",
        "stars": 3.0,
        "text": "Let me put this out here first:  My wife really enjoyed the food here but it was also her idea to try this place out.  \n\nNow let me begin, the pros:  The location and the vibe is really nice.  I totally enjoyed the hot chocolate!!!      \n\nThe cons:  The staff were ok but I just felt rushed once I sat down.  The food was meh.  I mean there wasn't a big variety and I wanted like fish/shrimp and grits.  There was none.  The wait was pretty long.  If you use the Yelp app you can get on the waiting list to cut down your wait time but other than that you better cop a squat and be patient.  \n\nWould I try it again?     Ehhhh  I don't think so but if the wife drags me here again.  I will be better prepared.\n\n\n(I'm going to change this to 3 stars because my wife complained that I was a bit unreasonable.)"
    },
    {
        "review_id": "nSnyEG-wufbpejCftcC3Nw",
        "stars": 2.0,
        "text": "I have to be VERY honest, I don't LOVE this place. I've been here multiple times and compare to the one in Warrington, it's a train wreck. They take FOREVER, to bring your food. When you get your food, it's cold, and then, it's such a small portion and looks like everything was thrown on the plate.  We had a party of 5, today, one being a child. Every single one of us, was disappointed. I wish I could say that this was the first time, but it isn't. I took my 2 young sons there, a few months ago, and we waited for an hour, in a basically empty place, for food AND drinks.  I figured maybe the staff was newer, which is why we went back this time. Nope.   It's WORLDS different between the two locations.  The ONLY redeeming factor is that their drinks are pretty cool.  They really need to get it together. They're like the before photo of a weight loss commercial, and Warrington is the after.  Trust me, go to the other location."
    },
    {
        "review_id": "hClXloEvRi7rAG7k6xAEIw",
        "stars": 3.0,
        "text": "*MEDIOCRE*\n\nFor one of the few brunch places that you can find in the suburbs, Turning Point is okay. The restaurant is quite crowded around 10-11 am on the weekend or holidays so I recommend making an reservation if you have a large party. They have so many options and are known for their pancakes. Their clean juices are pretty good but their food is alright. The dishes are decently sized but quite heavy so I'd recommend sharing one. Their pancakes are what you expected out of a standard pancake. Their omelets are quite bland so I don't recommend getting them. \n\n*VERDICT*\nI probably would not go back again unless someone asks me to."
    },
    {
        "review_id": "ZMgeoRG1RHrn5DoEXgiJlg",
        "stars": 5.0,
        "text": "Had a great breakfast here!  So many awesome coffee options.  Place was clean and service was great!  Had the Huevos Rancheros and loved it!  Highly recommend!"
    },
    {
        "review_id": "z8QZKZybH9O3-nvHJlTvyQ",
        "stars": 5.0,
        "text": "This was our first visit to this restaurant and we were very impressed, especially with all the COVID precautions. The staff was very friendly and attentive. The food was absolutely delicious and we will definitely be back! \n\nBacon Lollipops\nOmg French Toast"
    },
    {
        "review_id": "QKZNBRjs58QWghRK9aUnkA",
        "stars": 1.0,
        "text": "Terrible host service, 45 minute wait, seated other parties of the same size that arrived after us. Someone needs to manage this location, been a customer for a long time, likely done after this visit. Poor management."
    },
    {
        "review_id": "2jp7CNCeUrQ99QBiXbTFIQ",
        "stars": 5.0,
        "text": "The vibes are so cute and the presentation of food and drinks is amazing!! Lots of great and unique options. I've been twice and already can't wait to go back to try more. It was kind of slow but that's expected for any cute popular brunch place."
    },
    {
        "review_id": "ILjk1OCIHLPfwlb0eqnU8A",
        "stars": 2.0,
        "text": "I very rarely give bad reviews, but I can't in good faith give this restaurant above 2 stars. I have been multiple times and every time the service is subpar. Luckily the food is good and I don't mind sitting around waiting with friends, it usually makes up for the bad service. Two days ago I went with a friend and it was just abysmal. First we were standing waiting to be sat for aprox 5 minutes even though there were at least 10 empty tables and the waiters just kept walking right past us. Eventually someone sat us in between a slew of dirty uncleared tables. The tables stayed dirty the entire time we were there. It was unsightly and unsanitary and generally not good for the atmosphere. It appeared as if the waiters working were having some type of spat over who was taking what tables and it showed. We waited patiently as we enjoyed just sitting and talking but I noticed 2 other tables complaining about the wait. I noticed a table that was sat before mine didn't have water or coffee well after I got mine. Eventually our food came out and was TASTY! I had a nice time but overall this restaurant just does not seem to know how to get their act together. \n\n\nIt is very clearly a MANAGEMENT problem. The waiters working appeared to be working hard and doing their best but were mismanaged."
    },
    {
        "review_id": "QktS2Whr31B43R2j2ICa1Q",
        "stars": 4.0,
        "text": "Amazing vegan pancakes and vegan veggie omelette using just egg no cheese. Although they made a mistake of giving me vegan omelette without vegetables so they gave me another one that's why I have 2 pictures. COMPARE THE DIFFERENT OMELETTES. The new omelette with veggies is just like a real omelette with real eggs it's scary it feels like they gave me real eggs but the waiter said it's vegan. Waitress was very busy so I can't keep on asking her. I'm very skeptical about it. It felt like I was eating veggie omelette with real eggs. Love the area and the vibe of this location. There was a wait on the tables so we sat at the bar which is nice too... love their soy latte as well.. so fresh.. vegan omelette came with toast but it had butter so I didn't eat it. Clean bathrooms."
    },
    {
        "review_id": "5Z8soCvTvTohBTuVs_VNsQ",
        "stars": 5.0,
        "text": "I've been to Turning Point a number of times, and it's always been a good experience. My most recent visit compelled me to finally write a review. First, I got my birthday breakfast for free with the \"perks\" card. I almost felt guilty not paying for it, because \"The Big Easy Benedict\" was unbelievably delicious. It was an incredible blend of flavors and textures - the eggs were perfectly poached, there was just the right amount of cornbread, the onions and creole spice added some variety, the Chorizo was not too hot or too mild, and the Hollandaise sauce was absolutely lovely. The side of fried potatoes was very good too, though it was tough to finish them all. During the meal, the chef came out to ask how it was. I found out that he only started two weeks ago. Apparently, they made a really good hire!\n\nI also got some white-leaf tea with it, which always comes with a stirring stick of crystallized sugar and a cute little doily (so nice!). My son got a Reese's hot chocolate and waffles, which would be hard NOT to enjoy.\n\nThough the prices tend to be a smidge higher than your average diner, it's the perfect place to feel very fancy and have very high-quality food without spending nearly as much as you would at a high-scale restaurant for dinner."
    },
    {
        "review_id": "m98QS1IwkVzqAOVtX9-kXw",
        "stars": 2.0,
        "text": "Had the pumkin pancakes via a phone and pick up order. I asked for no toppings. They put pumkin seeds on top. I caught it and asked them to remake it. They did but it was throen in a to go container and very sloppily! ALmost zero flavor and the pancake was soggy!  So weird that I had the same order 3 weeks prior and it was fine.  Hit and miss place!"
    },
    {
        "review_id": "YdUisLo4HS9nwpA_SCZPwQ",
        "stars": 5.0,
        "text": "Fantastic food and even better service! I highly recommend the French press. They have a wide selection of healthy options that will fill you up, but not leave you feeling bloated."
    },
    {
        "review_id": "VQH-ZzB_he_QDRHhmxh7zw",
        "stars": 5.0,
        "text": "I seriously love this place! I live right behind it and have been going a bit too much haha. They actually made me like eggs. I love all the vegetarian options. I highly recommend huevos rancheros with beyond sausage!"
    },
    {
        "review_id": "tbg8H_KYqDhGXBKbhtUwOg",
        "stars": 4.0,
        "text": "First time visiting this establishment.  North wales is lacking in regards to places that serve breakfast and brunch .  Pumpernickel is terrible and Metropolitan's dinner menu is much better then their brunch.  Honestly this place just comes off as a breath of fresh air.  Upon entering most of the staff appear to be very young however, they were very professional.  They must of went through the rigorous chick fil a training.  Well done Turning Point.  We placed a call ahead reservation and when we arrived we were seated pretty fast around 11:30 AM.   Me and my Wife tried the French press coffee.  This is a first for me and I am a huge coffee lover.  The 32 ounces was more then enough and I would certainly order it again.  When I try a new restaurant especially for brunch the omelette is the first thing that draws my attention.  I ordered the key west omelette and switched out the sausage for turkey bacon.  I was very impressed.  Fluffy and loaded with huge shrimps and turkey bacon.  I like to order a side of salsa and sour cream and they came out in two large bowls, without a bother of me asking for more.  This place does not skimp out on portions and I love it.  On a negative note my sons French toast was not impressive.  The restaurant should consider using Texas toast or brioche bread for their French toast.  My wife stated The Turning point in cherry hill makes an amazing French toast.  I wish I had a picture to post but maybe next time will be better.    My omelette came with home fries from the frozen isle.  I hate frozen potatoes!  Nothing beats a potato made from scratch with fried onions and peppers.  These home fries were blan with no seasoning.  Not terrible enough to drop to a 3 star.  Everything can't be perfect. Great experience, great food, great customer service.  We will be back."
    },
    {
        "review_id": "B3S_kP1iGoWPOedC_PuF0g",
        "stars": 4.0,
        "text": "Went there on date. Shashuka was basically tomato soup with no flavor and poached eggs instead of actually Shashuka where eggs are cooked with dish. The reason I gave it 4 stars is because manager and service was excellent. They waived fee for shashuka and gave us classics eggs Benedict which was just the way I expected and remembered it."
    },
    {
        "review_id": "cMBCn0ZwOIWbFpRaMxD1EQ",
        "stars": 2.0,
        "text": "Clean and friendly environment. Coffee from Cowabunga was robust. Food was underwhelming. The specialty Mediterranean poached egg dish was basically all chopped tomatoes and hot peppers. The fluffy bread and rustic bowl are a nice touch. Adding hearty vegetables and/or potato could really make it a worthy signature of this kitchen."
    },
    {
        "review_id": "N8UeBh6xD8XHvgDOsDE1Eg",
        "stars": 5.0,
        "text": "I feel the need to update my review with a 5 star review. I have been back to Turning Point several times since my last review. It seems to me that Turning Point is really working on improving their customer service, and it's coming up to par with the high quality food. My friend and I walked in and were seated immediately and immediately offered coffee or another beverage. Our waitress checked on us multiple times, took our order quickly and the food came out shortly after. I got a skillet breakfast which was perfectly crispy and tasty. My friend got the breakfast nachos which were huge and delicious - the chorizo is so good! I highly recommend coming to Turning Point for a delicious breakfast in a great atmosphere with good service."
    },
    {
        "review_id": "7S19D_yJTxFIeF9Q7xC_Rg",
        "stars": 4.0,
        "text": "Well, here we are, back in PA for the holiday. The only meal we didn't have plans for was breakfast today. We were given the recommendation for Turning Point so off we went! \nWe were seated right away. I guess we hit that sweet spot for breaking our fast. There was a good crowd for Xmas Eve and most were donning masks. The servers all had masks on.\nWhen you walk in you notice right away the hip and fresh decor. It's very bright and cheery with cheeky signs (my fav was for the Employees only sign where you are threatened with indentured servitude)\nThe menu is a usual take on breakfast, but is also the reason I am only giving 4 stars. There were a lot of MEALS offered, but nothing light for those of us that don't like huge breakfasts. Here they WILL feed you.\nThere are no cold cereals, no options of a bagel or English muffin with jam. You will have eggs, pancakes, french toast or the crunchy granola fare of avocado toast or vegan eggs etc. I'm not a big breakfast fan so I got a small stack of plain pancakes while my mother got her usual eggs and toast.\nThe pancakes were cold. Not ice cold...but not hot. They had obviously been sitting outside of a heat lamp. They weren't fluffy but neither were they dense. They just were. The eggs were on the hard scramble side but the toast looked good. The bacon was really good \nSide note...they didn't spring for the real maple syrup which I found odd in a hipster dining place \nThe coffee, imo, was very strong. Not bitter, just very strong. It wasn't the best coffee but they leave you with a pitcher of it. They also leave a pitcher of water.\nThe prices were pretty standard for the area and the staff ranged from friendly to 'too cool for school'. It is a holiday so I am being very lenient...but these children have to remember they are in the service industry. That means you will work holidays. So put a smile on that face!!\nAll in all, it was a cute spot to have breakfast and we left replete."
    },
    {
        "review_id": "jDBn1vORisQELUDcdqwzmg",
        "stars": 5.0,
        "text": "We ordered brunch from Turning Point this morning. We ordered through DoorDash and picked up curbside. All we had to do when we got there was call, and our food was immediately brought to our car! \n\nWe ordered the pesto skillet and banana walnut pancakes. Both things were very good! The pesto skillet had great flavor and lots of yummy veggies. The banana walnut pancakes were definitely a favorite! They put all of the sauces and toppings in the side so the pancakes weren't soggy, which was much appreciated."
    },
    {
        "review_id": "nc-YUGoKuty77LRipCsuVg",
        "stars": 5.0,
        "text": "They just added vegans options that were really good. We got the omelet, the waffles and the ciabatta sandwich and they were all really good! My least favorite was the sandwich but thats because I'm not a huge avocado fan, and I'm sure someone who love avocado would love it. Definitely coming back!"
    },
    {
        "review_id": "hNahN_JqQPnp9JrnicP2dQ",
        "stars": 5.0,
        "text": "The food is fresh and delicious! Servers are friendly and efficient. GOAT omelette was delicious. Reese's peanut butter pancakes were great and bourbon bacon was creative and tasty!"
    },
    {
        "review_id": "INQbW5yVGzQd6YTxr13ClA",
        "stars": 5.0,
        "text": "Service was excellent. Lauryn was the best.\nThe food was over the top delicious. You must have the bacon lollipops. \nWill definitely go back. \nGo hungry and be ready for a GREAT breakfast!!!"
    },
    {
        "review_id": "zHrDzUGa-nhyEzsYCUb76Q",
        "stars": 5.0,
        "text": "Great service and friendly staff. Amazing food. Unlike other diners it didn't make me shit immediately ."
    },
    {
        "review_id": "Shl16c3b9FyAPaeAH3Rs_Q",
        "stars": 3.0,
        "text": "Food was good and staff is nice but service is slow. This was my second time here and service was slow then also.  Brought out my husband's food fist with my side then 10 minutes my food came out."
    },
    {
        "review_id": "sAuY75syZxToSIyXCBuycA",
        "stars": 4.0,
        "text": "\"When I dip you dip we dip!\"\n\n\"You put yours and I put mine \nAnd we can get down low \nAnd roll it round!\"\n\nI may be referencing the lyrics from Da Dip by Freak Nasty but my friends I am talking about the deliciousness of The Turning Point.\n\nI endulged on the Flight of Pancakes this joyous New Year and what a presentation of Bourbon Walnut Banana, Cinnamon Roll, and Berry Chocolatey panckes it is indeed. You get two pancakes of each selection and my favorite was hands down the Bourbon Walnut Banana which has alot going on but do not be afraid to redip that bourbon flavored pancake in the maple syrup. The Cinnamon pancake has a cheese frosting on it detailed in the picture and I can say I never had such a unique pancake. The Berry Chocolatey pancake was my least favorite as it had a bittersweet dark chocolate flavor to it and I feel most pancake fanatics will criticize. You can however choose one of there other options like the lemon blueberry pancake option.\n\nThis breakfast joint has spectucular coffee options including French Press coffee for an upcharge of $7.25 per pot if you want to splurge. I have gotten the OMG french toast here before again you are getting a meal full of sugar but they have a whole list of healthy options as well.\n\nI will be back to this establishment and highly recommend you venture into The Turning Point if you are a virgin to the experience. And as always people SYOY!!!"
    },
    {
        "review_id": "2haIzJGK2TIOm8L59hBKsg",
        "stars": 4.0,
        "text": "I came here on a Sunday around 11, hoping that the wait wouldn't be too bad. My girlfriend and I had heard the hype about this place and wanted to try it out. We were told the wait for two was about 45 minutes (!) or we could try waiting for a spot at the cafe bar (about 6 seats in total). We ended up taking the loss in the wait and just going to Trader Joe's nearby for some shopping. \n\nAfter about an hour, we were seated and served. The coffee and drinks come out very quickly, but our food did take some time. I ordered the Wilbur Skillet and she got the Western Omelet. We did expect the food to be relatively fast, given how simple it seemed to be, but it took a bit longer than expected. The staff was super friendly and probably the main reason I'm giving this place an extra star. They made sure we were taken care of and remade the omelet for my girlfriend when the salt shaker broke over her dish. While the food wasn't anything too special, the service was top notch and made our experience extremely delightful. \n\nI highly recommend joining the waitlist from yelp or calling in, as 45min-1 hour is rough on a weekend. All in all, it was a nice time on a Sunday afternoon!"
    },
    {
        "review_id": "lf-9YaBhlfTMz-qlVKZm4g",
        "stars": 2.0,
        "text": "So I've been to Turning Point now three times and unfortunately I will have to agree with many of the other posts and say the service here was pretty terrible this past time. It was never really attentive and fast service to begin with, but it was unfortunately extra sub-par this time around. Our waitress was not very friendly and we had to wait quite a while for basic things (like water and coffee... and then waiting even more for creamer). And then obviously that foreshadowed the slowness before getting our actual meal. Not only was it a slow experience, but our waitress never once checked up on us, asked us if we needed anything, apologized for the slow service, and she didn't even acknowledge us at times. Please improve your customer service because most of your food is pretty good. Also, I did enjoy my sweet potato hash, but it was different than the last time I got it... unfortunately, the sweet potatoes were mushy rather than formed and they were seasoned with cinnamon which was rather odd and it wasn't that way the last time I got it.\nOne positive thing is that they do have a variety on their menu, including vegan options... and also that the restaurant itself is clean and aesthetically pleasing. Food looks good and it tastes pretty good for the most part, but also there were a few things lacking it was nothing special during this visit."
    }
]